
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(Объект.СтатусОбменаСАрхивом, Истина) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СтатусыОбмена = Перечисления.СтатусыОбменаС1САрхивом;
	ОбнаруженыОшибки = Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриВыгрузке
		Или Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив
		Или Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриПроверкеВАрхиве;
	
	СписокВыбораСтатуса = Элементы.СтатусОбменаСАрхивом.СписокВыбора;
	СписокВыбораСтатуса.Очистить();
	СписокВыбораСтатуса.Добавить(Объект.СтатусОбменаСАрхивом);
	Если Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ГотовКВыгрузке Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.НеГотовКВыгрузке);
	ИначеЕсли Объект.СтатусОбменаСАрхивом = СтатусыОбмена.НеГотовКВыгрузке Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.ГотовКВыгрузке);
	ИначеЕсли ОбнаруженыОшибки Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.ГотовКВыгрузке);
	КонецЕсли;
	
	// Результат проверки отображается только в случае ошибки.
	Элементы.ДекорацияРезультатПроверки.Видимость = ОбнаруженыОшибки;
	
	Элементы.ДатаСоздания.Видимость = ЗначениеЗаполнено(Объект.ДатаСоздания);
	Элементы.ДатаПередачи.Видимость = ЗначениеЗаполнено(Объект.ДатаПередачи);
	Элементы.ДатаПриемки.Видимость = ЗначениеЗаполнено(Объект.ДатаПриемки);
	
	ПометкиДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		Объект.Документы.Выгрузить().ВыгрузитьКолонку("Документ"), "ПометкаУдаления");
	Для Каждого Стр Из Объект.Документы Цикл
		Стр.ПометкаУдаления = ПометкиДокументов[Стр.Документ];
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияРезультатПроверкиНажатие(Элемент)
		
	Если ЗначениеЗаполнено(Объект.РезультатПроверки) Тогда
		ПараметрыФормы = Новый Структура("РезультатПроверки, СтатусВыгрузкиВАрхив", Объект.РезультатПроверки, Объект.СтатусОбменаСАрхивом);
		ОткрытьФорму("Справочник.ПакетыДокументовДля1САрхива.Форма.ФормаРезультатПроверки", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаСАрхивомПриИзменении(Элемент)
	
	Если Объект.СтатусОбменаСАрхивом = ПредопределенноеЗначение(
			"Перечисление.СтатусыОбменаС1САрхивом.ГотовКВыгрузке") Тогда
		Объект.Передал = ОбменСАрхивомВызовСервера.ФизЛицоТекущегоПользователя();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент = Элементы.ДокументыДокумент Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыДокумент");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементШрифтОформления = ЭлементОформления.Оформление.Элементы.Найти("Шрифт");
	ЭлементШрифтОформления.Значение = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,,Истина);
	ЭлементШрифтОформления.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти
