#Область ПрограммныйИнтерфейс

// Обработчик регламентного задания "Обмен с Архивом".
//
Процедура ВыполнитьОбмен() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ОбменС1САрхивом);
	
	ПараметрыТранспорта = ОбменСАрхивомТранспорт.ПараметрыТранспортаДляСеансаОбмена();
	Если ПараметрыТранспорта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанные(ПараметрыТранспорта);
	ВыгрузитьДанные(ПараметрыТранспорта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСФормами

// Выводит элементы на форму. Для вызова из обработчика формы ПриСозданииНаСервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма объекта.
//   ПараметрыРазмещения - Структура, Неопределено - см. ОбменСАрхивом.ПараметрыРазмещенияЭлементов
//
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения = Неопределено) Экспорт
	
#Если Не ВнешнееСоединение Тогда
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом") Тогда
		Возврат
	КонецЕсли;
	
	ЭтоФормаОбъекта = ЭтоФормаОбъекта(Форма);
	ИмяПроцедуры = "ОбменСАрхивом.ПриСозданииНаСервере";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяПроцедуры, "Форма", Форма, Тип("ФормаКлиентскогоПриложения"));
	
	Если Не ЭтоФормаОбъекта Тогда
		ПриСозданииНаСервереФормыСписка(Форма, ПараметрыРазмещения);
		Возврат;
	КонецЕсли;
	
	Объект = ОбъектИзФормы(Форма);
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументыБИАНаФорме(Форма, ПараметрыРазмещения);
	
	// Размещение команд отправки в Архив и отмены отправки.
	ПанельРазмещенияКоманд = Неопределено;
	ИмяПанели = Форма.ДанныеБИА.ПараметрыРазмещения.ПанельРазмещенияКоманд;
	Если ЗначениеЗаполнено(ИмяПанели) Тогда
		ПанельРазмещенияКоманд = Форма.Элементы.Найти(ИмяПанели);
	КонецЕсли;
	Если ПанельРазмещенияКоманд = Неопределено Тогда
		ПанельРазмещенияКоманд = Форма.КоманднаяПанель;
	КонецЕсли;
	
	ИменаИсключаемыхКоманд = Новый Массив;
	ОбменСАрхивомПереопределяемый.ПриОпределенииИменИсключаемыхКоманд(
		Форма, ИменаИсключаемыхКоманд);
	
	// Отправить.
	ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыОтправитьВ1САрхив();
	Если ИменаИсключаемыхКоманд.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаОтправить = Форма.Команды.Добавить(ИмяКоманды);
		КомандаОтправить.Заголовок = НСтр("ru = 'Отправить в 1С:Архив'");
		КомандаОтправить.Действие = "Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом";
		КнопкаОтправить = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПанельРазмещенияКоманд);
		КнопкаОтправить.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаОтправить.ИмяКоманды = ИмяКоманды;
		КнопкаОтправить.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	// Отмена отправки.
	ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыОтменитьОтправкуВ1САрхив();
	Если ИменаИсключаемыхКоманд.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаОтменить = Форма.Команды.Добавить(ИмяКоманды);
		КомандаОтменить.Заголовок = НСтр("ru = 'Отменить отправку в 1С:Архив'");
		КомандаОтменить.Действие = "Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом";
		КнопкаОтменить = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПанельРазмещенияКоманд);
		КнопкаОтменить.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаОтменить.ИмяКоманды = ИмяКоманды;
		КнопкаОтменить.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	// Отзыв.
	ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыОтозватьИз1САрхива();
	Если ИменаИсключаемыхКоманд.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаОтменить = Форма.Команды.Добавить(ИмяКоманды);
		КомандаОтменить.Заголовок = НСтр("ru = 'Отозвать из 1С:Архива'");
		КомандаОтменить.Действие = "Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом";
		КнопкаОтменить = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПанельРазмещенияКоманд);
		КнопкаОтменить.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаОтменить.ИмяКоманды = ИмяКоманды;
		КнопкаОтменить.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	// История обмена.
	ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыИсторияОбмена();
	Если ИменаИсключаемыхКоманд.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаОтменить = Форма.Команды.Добавить(ИмяКоманды);
		КомандаОтменить.Заголовок = НСтр("ru = 'История обмена с 1С:Архивом'");
		КомандаОтменить.Действие = "Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом";
		КнопкаОтменить = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПанельРазмещенияКоманд);
		КнопкаОтменить.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаОтменить.ИмяКоманды = ИмяКоманды;
		КнопкаОтменить.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	УстановитьВидимостьИДоступностьКоманд(Форма);
	
	ОбменСАрхивомПереопределяемый.ПриСозданииНаСервере(Форма, ПараметрыРазмещения, Истина);
	
#Иначе
	ВызватьИсключение НСтр(
		"ru = 'Метод ""ОбменСАрхивом.ПриСозданииНаСервере"" недоступен во внешнем соединении.'");
#КонецЕсли
	
КонецПроцедуры

// Конструктор параметра процедуры ОбменСАрхивом.ПриСозданииНаСервере.
//
// Возвращаемое значение:
//   Структура - параметры размещения элементов формы:
//       * ПанельРазмещенияКоманд - ГруппаФормы, Неопределено - командная панель, в которой
//           выводятся команды отправки в 1С:Архив и отмены отправки (для форм элементов).
//           Если не заполнена, используется ком. панель формы элемента.
//       * ГруппаРазмещенияЭлементов - ГруппаФормы, Неопределено - группа, в которой 
//           выводятся элементы после того, как документ отправлен в Архив (для форм элементов).
//           Если не заполнена, элементы добавляются в верхнюю часть формы.
//       * ИмяСписка - Строка - имя элемента с таблицей списка интегируемых объектов (для форм списков).
//           Если не заполнено, используется значение "Список".
//       * ИмяКолонкиОбъекта - Строка - имя колонки таблицы, в которой содержится
//           ссылка на интегируемые объекты (для форм списков). Если не заполнено, используется значение "Ссылка".
//
Функция ПараметрыРазмещенияЭлементов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПанельРазмещенияКоманд", Неопределено);
	Результат.Вставить("ГруппаРазмещенияЭлементов", Неопределено);
	Результат.Вставить("ИмяСписка", "");
	Результат.Вставить("ИмяКолонкиОбъекта", "");
	Возврат Результат;
	
КонецФункции

// Реализация выполнения подключаемой команды из формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта.
//  ДополнительныеПараметры - Структура - см. 
// 
Процедура ВыполнитьПодключаемуюКоманду(Форма, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыОтправитьВ1САрхив() Тогда
		ПодготовитьДокументКВыгрузке(ДополнительныеПараметры.Ссылка);
		ЗаполнитьДокументыБИАНаФорме(Форма);
		УстановитьВидимостьИДоступностьКоманд(Форма);
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыОтменитьОтправкуВ1САрхив() Тогда
		ОтменитьПодготовкуДокументаКВыгрузке(ДополнительныеПараметры.Ссылка);
		ЗаполнитьДокументыБИАНаФорме(Форма);
		УстановитьВидимостьИДоступностьКоманд(Форма);
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыОтозватьИз1САрхива() Тогда
		ОтозватьДокументИзАрхива(ДополнительныеПараметры.Ссылка);
		ЗаполнитьДокументыБИАНаФорме(Форма);
		УстановитьВидимостьИДоступностьКоманд(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Заполнение данных подсистемы при начале работы с новой базой.
// 
Процедура НачальноеЗаполнение() Экспорт
	
	Константы.МаксимальноеКоличествоДокументовВПакетеДля1САрхива.Установить(
		МаксКоличествоДокументовВПакете());
	
КонецПроцедуры

#КонецОбласти

#Область ПодпискиНаСобытия

// Обработчик подписки на событие.
//
// Параметры:
//  Источник - ОпределяемыйТип.ДокументОбъектБИА - документ
//  Отказ - Булево
//  РежимЗаписи - РежимЗаписиДокумента
//  РежимПроведения - РежимПроведенияДокумента
//  
Процедура ПередЗаписьюДокументаОбработчик(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбработчикПодпискиПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПередЗаписьюСправочникаОбработчик(Источник, Отказ) Экспорт
	
	ОбработчикПодпискиПередЗаписью(Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменНСИСАрхивомЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
	   И Не Источник.ДополнительныеСвойства.Свойство("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелАрхив = ПланыОбмена.ОбменНСИСАрхивом.УзелАрхив();
	Источник.ОбменДанными.Получатели.Добавить(УзелАрхив);
	
КонецПроцедуры

#КонецОбласти

// Возвращает список доступных для текущей конфигурации версий формата обмена.
//
// Возвращаемое значение:
//  СписокЗначений из Строка - список форматов.
//   Значение - пространство имен XDTO-пакета поддерживаемой версии,
//   Представление - пользовательское представление версии.
//
Функция ВерсииФорматаДоступные() Экспорт
	
	СписокВерсий = Новый СписокЗначений;
	
	НестандартныеПредставления = Новый Соответствие;
	НестандартныеПредставления[Метаданные.ПакетыXDTO.АДХ_1_0_3] = "1.0.6";
	
	ТаблицаВерсий = Новый ТаблицаЗначений;
	ТаблицаВерсий.Колонки.Добавить("ПространствоИмен");
	ТаблицаВерсий.Колонки.Добавить("Представление");
	ТаблицаВерсий.Колонки.Добавить("ЗначениеДляСортировки");
	
	Для Каждого Пакет Из Метаданные.ПакетыXDTO Цикл
		Если Не СтрНачинаетсяС(Пакет.Имя, "АДХ_") Тогда
			Если СписокВерсий.Количество() = 0 Тогда
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЕсли;
		СтрокаВерсии = ТаблицаВерсий.Добавить();
		СтрокаВерсии.ПространствоИмен = Пакет.ПространствоИмен;
		СтрокаВерсии.Представление = НестандартныеПредставления[Пакет];
		Если СтрокаВерсии.Представление = Неопределено Тогда
			СтрокаВерсии.Представление = ПредставлениеВерсииФормата(СтрокаВерсии.ПространствоИмен);
		КонецЕсли;
		СтрокаВерсии.ЗначениеДляСортировки = 0;
		ЧастиНомераВерсии = СтрРазделить(СтрокаВерсии.Представление, ".");
		КолСтрок = ЧастиНомераВерсии.Количество();
		Для Сч = 1 По КолСтрок Цикл
			ЧастьНомера = Число(ЧастиНомераВерсии[КолСтрок - Сч]);
			СтрокаВерсии.ЗначениеДляСортировки = СтрокаВерсии.ЗначениеДляСортировки + ЧастьНомера * Pow(1000, Сч-1);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаВерсий.Сортировать("ЗначениеДляСортировки Убыв");
	Для Каждого СтрокаВерсии Из ТаблицаВерсий Цикл
		СписокВерсий.Добавить(СтрокаВерсии.ПространствоИмен, СтрокаВерсии.Представление);
	КонецЦикла;
	
	Возврат СписокВерсий;
	
КонецФункции

// Возвращает пространство имен актуального пакета XDTO.
// 
// Возвращаемое значение:
//  Строка - версия формата (пространство имен XDTO-пакета).
// 
Функция ВерсияФорматаДляОтправкиСообщений() Экспорт
	
	ВерсияДляОтправки = ВерсияФорматаБазыАрхива();
	ВерсияМаксимальная = ВерсияФорматаМаксимальная();
	
	Если СравнитьВерсииФормата(ВерсияДляОтправки, ВерсияМаксимальная) > 0 Тогда
		ВерсияДляОтправки = ВерсияМаксимальная;
	КонецЕсли;
	
	Возврат ВерсияДляОтправки;
	
КонецФункции

// Возвращает версию формата, поддерживаемую 1С:Архивом. Если не заполнена, выдается исключение.
// 
// Параметры:
//  ВызыватьИсключение - Булево - Если Истина и константа не заполнена, то будет вызвано исключение.
// 
// Возвращаемое значение:
//  Строка - версия формата (пространство имен XDTO-пакета).
// 
Функция ВерсияФорматаБазыАрхива(ВызыватьИсключение = Истина) Экспорт
	
	Версия = Константы.ВерсияФорматаОбменаПоддерживаемая1САрхивом.Получить();
	Если ВызыватьИсключение И Не ЗначениеЗаполнено(Версия) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнено значение настройки ""%1"". Обратитесь к администратору.
			|
			|Контроль версий осуществляется автоматически, но что-то пошло не так. Пожалуйста, обратитесь в поддержку. Для обхода проблемы можно указать версию, которую поддерживает ваша база 1С:Архива, вручную. См. ""Настройка программы - Интеграция с 1С:Архивом - Версия формата"".'"),
			Метаданные.Константы.ВерсияФорматаОбменаПоддерживаемая1САрхивом.Синоним);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат Версия;
	
КонецФункции

// Формирует сообщения для 1С:Архива о поддерживаемой версии формата файлов обмена.
//
Процедура СформироватьСообщениеОВерсииФормата() Экспорт
	
	ВерсияФормата = ВерсияФорматаМаксимальная();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Новый Структура(ИмяСвойстваВерсияФормата(), ВерсияФормата));
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	НачатьТранзакцию();
	Попытка
		РегистрыСведений.СообщенияДля1САрхива.Добавить(ИмяСвойстваВерсияФормата(), СтрокаJSON);
		ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			СтрШаблон(НСтр("ru = 'Формирование сообщения о версии формата (%1)'"), ВерсияФормата),,
			Пользователи.ТекущийПользователь());
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось сформировать сообщение с версией формата по причине:
			|
			|%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

// Сравнивает две строки версий формата.
//
// Параметры:
//  ВерсияФормата1 - Строка - формат в виде пространства имен (например, "http://v8.1c.ru/doc8/LTA/1.0.8").
//  ВерсияФормата2 - Строка - формат в виде пространства имен.
//
// Возвращаемое значение:
//   Число   - больше 0, если ВерсияФормата1 > ВерсияФормата2; 0, если версии равны.
//
Функция СравнитьВерсииФормата(ВерсияФормата1, ВерсияФормата2) Экспорт
	
	ПредставлениеВерсии1 = ПредставлениеВерсииФормата(ВерсияФормата1) + ".0";
	ПредставлениеВерсии2 = ПредставлениеВерсииФормата(ВерсияФормата2) + ".0";
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ПредставлениеВерсии1, ПредставлениеВерсии2);
	
КонецФункции

// Пользовательское представление версии формата.
//
// Параметры:
//  Версия - Строка - формат в виде пространства имен (например, "http://v8.1c.ru/doc8/LTA/1.0.8").
//
// Возвращаемое значение:
//   Строка - представление версии для пользовательского интерфейса.
//
Функция ПредставлениеВерсииФормата(Версия) Экспорт
	
	ПредставлениеВерсии = Версия;
	ЧастиПространстваИмен = СтрРазделить(Версия, "/");
	Если ЧастиПространстваИмен.Количество() > 1 Тогда
		ПредставлениеВерсии = ЧастиПространстваИмен[ЧастиПространстваИмен.Количество() - 1];
	КонецЕсли;
	
	Возврат ПредставлениеВерсии;
	
КонецФункции

// Возвращает строку, которая будет передана в 1С:Архив в качестве идентификатора объекта.
//
// Параметры:
//  Ссылка - СправочникСсылка - ссылка на элемент (НСИ, ДокументБИА).
//
// Возвращаемое значение:
//  Строка - значение идентификатора.
//
Функция ИдентификаторСсылки(Ссылка) Экспорт
	
	Идентификатор = ОбменСАрхивомПереопределяемый.ИдентификаторСсылки(Ссылка);
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Идентификатор;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Валюты")
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Валюты") Тогда
		Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Код");
		Возврат Строка(Код);
	КонецЕсли;
	
	Возврат Строка(Ссылка.УникальныйИдентификатор());
	
КонецФункции

// Возвращает структуру описания МЧД для последующей выгрузки в 1С:Архив.
//
// Возвращаемое значение:
//  Структура:
//   * Тип - Строка - значение из перечисления WarrantType пакета XDTO.
//      "EMCHD" для формата 003, "ON_DOVBB" для предыдущих форматов.
//   * НомерДоверенности - Строка - номер доверенности.
//   * ЕстьВРеестреФНС - Булево - Истина, если доверенность помещена в реестр ФНС.
//   * ИННДоверителя - Строка - ИНН доверителя.
//   * ИмяФайлаМЧД - Строка - локальное имя файла доверенности в папке ВременнаяПапка.
//       Обязательно для нереестровых доверенностей.
//   * ИмяФайлаПодписиМЧД - Строка - локальное имя файла подписи доверенности в папке ВременнаяПапка.
//       Обязательно для нереестровых доверенностей.
//   * Комментарий - Строка - произвольный комментарий.
// 
// Если выгрузка элемента не требуется, возвращается Неопределено.
//
Функция НовоеОписаниеМЧД() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Тип", "");
	Описание.Вставить("НомерДоверенности", "");
	Описание.Вставить("ЕстьВРеестреФНС", Ложь);
	Описание.Вставить("ИННДоверителя", "");
	Описание.Вставить("ИмяФайлаМЧД", "");
	Описание.Вставить("ИмяФайлаПодписиМЧД", "");
	Описание.Вставить("Комментарий", "");
	
	Возврат Описание;
	
КонецФункции

// Возвращает таблицу документов БИА, созданных на основании переданного объекта.
//
// Параметры:
//  ОснованиеСсылка - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - ссылка на прикладной объект
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица документов БИА
// 
Функция ТаблицаДокументовБИА(ОснованиеСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДокументыБИА.Ссылка КАК Документ,
		|	ДокументыБИА.ВидДокумента КАК ВидДокумента,
		|	ДокументыБИА.Автор КАК Автор,
		|	ДокументыБИА.Уничтожен КАК Уничтожен,
		|	ЕСТЬNULL(СтатусыОбменаДокументовБИА.Статус, &СтатусНеГотов) КАК Статус,
		|	НЕ ЕСТЬNULL(СтатусыОбменаДокументовБИА.Статус, &СтатусНеГотов) В (&СтатусыНеВыгруженныхДокументов) КАК Выгружен
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
		|		ПО ДокументыБИА.Ссылка = СтатусыОбменаДокументовБИА.ДокументБИА
		|ГДЕ
		|	ДокументыБИА.ОбъектОснование = &ОснованиеСсылка
		|	И НЕ ДокументыБИА.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ
		|АВТОУПОРЯДОЧИВАНИЕ");

	СтатусыМенеджер = Перечисления.СтатусыОбменаС1САрхивом;
	СтатусыНеВыгруженныхДокументов = Новый Массив;
	СтатусыНеВыгруженныхДокументов.Добавить(СтатусыМенеджер.ГотовКВыгрузке);
	СтатусыНеВыгруженныхДокументов.Добавить(СтатусыМенеджер.НеГотовКВыгрузке);
	СтатусыНеВыгруженныхДокументов.Добавить(СтатусыМенеджер.ОбнаруженыОшибкиПриВыгрузке);
	
	Запрос.УстановитьПараметр("ОснованиеСсылка", ОснованиеСсылка);
	Запрос.УстановитьПараметр("СтатусНеГотов", СтатусыМенеджер.НеГотовКВыгрузке);
	Запрос.УстановитьПараметр("СтатусыНеВыгруженныхДокументов", СтатусыНеВыгруженныхДокументов);
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПодготовитьДокументКВыгрузке(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	ОбменСАрхивомПереопределяемый.ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(	
		МетаданныеОбъекта.ПолноеИмя());
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(МетаданныеОбъекта.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ДокументыБИА.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("ОбъектОснование", Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ЕстьОшибкиПроверки = Ложь;
		ДокументыБИА = СоздатьДокументыБИА(Ссылка, МенеджерОбъекта);
		Если ДокументыБИА.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Документы для 1С:Архива не сформированы. Обратитесь к администратору.'");
		КонецЕсли;
		Для Каждого ДокументОбъект Из ДокументыБИА Цикл
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
				ДокументОбъект.Записать();
			Иначе
				ЕстьОшибкиПроверки = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОшибкиПроверки Тогда
			ВызватьИсключение НСтр("ru = 'Обнаружены ошибки проверки заполнения документов для 1С:Архива'");
		Иначе
			РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(Ссылка,
				Перечисления.СобытияОбменаС1САрхивом.ОтметкаДокументаКВыгрузке);
			РегистрыСведений.ДокументыОтправленныеВ1САрхив.Добавить(Ссылка);
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтменитьПодготовкуДокументаКВыгрузке(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Ссылка.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ДокументыБИА.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("ОбъектОснование", Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ТабДокументовБИА = ТаблицаДокументовБИА(Ссылка);
		Для Каждого СтрокаДокумента Из ТабДокументовБИА Цикл
			ДокументБИАОбъект = СтрокаДокумента.Документ.ПолучитьОбъект();
			ДокументБИАОбъект.ДополнительныеСвойства.Вставить("ЭтоОтзывДокумента", Истина);
			ДокументБИАОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(Ссылка,
			Перечисления.СобытияОбменаС1САрхивом.ОтменаОтметкиДокументаКВыгрузке);
		РегистрыСведений.ДокументыОтправленныеВ1САрхив.Удалить(Ссылка);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтозватьДокументИзАрхива(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Ссылка.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ДокументыБИА.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("ОбъектОснование", Ссылка);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТЧПакетов.Ссылка КАК Пакет,
		|	ТЧПакетов.Документ КАК ДокументБИА
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ТЧПакетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
		|		ПО ТЧПакетов.Документ = ДокументыБИА.Ссылка
		|ГДЕ
		|	ДокументыБИА.ОбъектОснование = &ОбъектОснование
		|ИТОГИ
		|ПО
		|	Пакет");
	Запрос.УстановитьПараметр("ОбъектОснование", Ссылка);
	
	ОтозванныеДокументыПакетов = Новый Соответствие;
	ВыборкаПакеты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПакеты.Следующий() Цикл
		ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ПакетыДокументовДля1САрхива.ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаПакеты.Пакет);
		ОтозванныеДокументыПакета = Новый Соответствие;
		Выборка = ВыборкаПакеты.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОтозванныеДокументыПакета[Выборка.ДокументБИА] = Истина;
		КонецЦикла;
		ОтозванныеДокументыПакетов[ВыборкаПакеты.Пакет] = ОтозванныеДокументыПакета;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ТабДокументовБИА = ТаблицаДокументовБИА(Ссылка);
		Для Каждого СтрокаДокумента Из ТабДокументовБИА Цикл
			ДокументБИАОбъект = СтрокаДокумента.Документ.ПолучитьОбъект();
			ДокументБИАОбъект.ДополнительныеСвойства.Вставить("ЭтоОтзывДокумента", Истина);
			ДокументБИАОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		Для Каждого КлючИЗначение Из ОтозванныеДокументыПакетов Цикл
			Пакет = КлючИЗначение.Ключ;
			ОтозванныеДокументыПакета = КлючИЗначение.Значение;
			ПакетОбъект = Пакет.ПолучитьОбъект();
			КолСтрок = ПакетОбъект.Документы.Количество();
			Для Сч = 1 По КолСтрок Цикл
				СтрокаДокумента = ПакетОбъект.Документы[КолСтрок - Сч];
				Если ОтозванныеДокументыПакета[СтрокаДокумента.Документ] <> Неопределено Тогда
					ПакетОбъект.Документы.Удалить(СтрокаДокумента);
				КонецЕсли;
			КонецЦикла;
			ПакетОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуСтатусаПриЗаписи", Истина);
			ПакетОбъект.Записать();
		КонецЦикла;
		РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(Ссылка,
			Перечисления.СобытияОбменаС1САрхивом.ОтзывДокументаИзАрхива);
		РегистрыСведений.ДокументыОтправленныеВ1САрхив.Удалить(Ссылка);
		ОтменитьУдалениеДанныхДокументовПринятыхВАрхив(Ссылка);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ТипыXDTOПоТипамЗначений() Экспорт
	
	ИменаТиповXDTO = Новый Соответствие;
	ИменаТиповXDTO[Тип("Строка")] = "String";
	ИменаТиповXDTO[Тип("Число")]  = "Numeric";
	ИменаТиповXDTO[Тип("Булево")] = "Boolean";
	ИменаТиповXDTO[Тип("Дата")]   = "Date";
	
	ИменаТиповXDTO[Тип("СправочникСсылка.ДокументыБИА")] = "Document";
	ИменаТиповXDTO[Тип("СправочникСсылка.ВидыДокументовБИА")] = "DocumentType";
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Валюты") Тогда
		ИменаТиповXDTO[Тип("СправочникСсылка.Валюты")] = "Currency";
	КонецЕсли;
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ГрифДоступаБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "SecurityLevel";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ДолжностьБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Title";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.КонтрагентБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Counterparty";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ОрганизацияБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Organization";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ПодразделениеБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Department";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ПроектБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Project";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.СотрудникБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Employee";
	КонецЦикла;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ФизическоеЛицоБИА.Тип.Типы() Цикл
		ИменаТиповXDTO[Тип] = "Individual";
	КонецЦикла;
	
	Возврат ИменаТиповXDTO;
	
КонецФункции

Процедура УдалитьВременныеФайлы(ВременнаяПапка) Экспорт
	
	Попытка
		УдалитьФайлы(ВременнаяПапка);
	Исключение
		ЛогированиеОперацийОбменаСАрхивом(
			СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Функция ДоступноРедактированиеПоСтатусу(СтатусОбменаСАрхивом, ЭтоПакетДокументов = Ложь) Экспорт

	СтатусыОбмена = Перечисления.СтатусыОбменаС1САрхивом;
	РедактированиеДоступно =
		СтатусОбменаСАрхивом = СтатусыОбмена.ПустаяСсылка()
		Или СтатусОбменаСАрхивом = СтатусыОбмена.НеГотовКВыгрузке
		Или СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриВыгрузке
		Или СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив
		Или СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриПроверкеВАрхиве
		Или ЭтоПакетДокументов И СтатусОбменаСАрхивом = СтатусыОбмена.ГотовКВыгрузке;
	
	Возврат РедактированиеДоступно;
	
КонецФункции

// Обработчик регламентного задания ОбработкаОчередиОперацийСДокументамиДля1САрхива.
// 
Процедура ОбработкаОчередиОперацийСДокументами() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ОбработкаОчередиОперацийСДокументамиДля1САрхива);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Количество = РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива.ОбработатьПорцию();
	Пока Количество <> 0 Цикл
		Количество = РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива.ОбработатьПорцию();
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет отложенные операции по передаче документов в архив (удаление данных объекта).
//
// Параметры:
//  ДокументыДляОбработки - Массив из ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - документы для обработки.
//  Немедленно - Булево - если Ложь, то задание записывается в очередь, удаление выполняется отложенно.
//
Процедура УдалитьДанныеДокументовПринятыхВАрхив(ДокументыДляОбработки, Немедленно = Ложь) Экспорт
	
	Если Не Немедленно Тогда
		ДопСведения = РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива
			.ИмяОперацииУдаленияДанныхПринятогоОбъекта();
		ДатаУдаления = ТекущаяДатаСеанса() + 14 * 24 * 3600;
		Для Каждого Документ Из ДокументыДляОбработки Цикл
			РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива.Добавить(
				Документ, ДопСведения, ДатаУдаления);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	ОбменСАрхивомПереопределяемый.УдалитьДанныеДокументовПринятыхВАрхив(Документы, СтандартнаяОбработка);
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДокументыБИА.Ссылка КАК Ссылка,
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДокументыБИАФайлы.Файл) = ТИП(Справочник.ВерсииФайлов)
		|			ТОГДА ВЫРАЗИТЬ(ДокументыБИАФайлы.Файл КАК Справочник.ВерсииФайлов).Владелец
		|		ИНАЧЕ ДокументыБИАФайлы.Файл
		|	КОНЕЦ КАК Файл,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДокументыБИАФайлы.ФайлВизуализации) = ТИП(Справочник.ВерсииФайлов)
		|			ТОГДА ВЫРАЗИТЬ(ДокументыБИАФайлы.ФайлВизуализации КАК Справочник.ВерсииФайлов).Владелец
		|		ИНАЧЕ ДокументыБИАФайлы.ФайлВизуализации
		|	КОНЕЦ КАК ФайлВизуализации
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА.Файлы КАК ДокументыБИАФайлы
		|		ПО (ДокументыБИАФайлы.Ссылка = ДокументыБИА.Ссылка)
		|ГДЕ
		|	ДокументыБИА.ОбъектОснование В (&Документы)
		|	И НЕ ДокументыБИА.ПометкаУдаления
		|ИТОГИ
		|ПО
		|	ОбъектОснование");
	
	Запрос.УстановитьПараметр("Документы", ДокументыДляОбработки);
	
	ВыборкаОснование = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОснование.Следующий() Цикл
		
		УдаленоФайлов = 0;
		ОбъектОснование = ВыборкаОснование.ОбъектОснование;
		
		НачатьТранзакцию();
		
		Попытка
			
			Выборка = ВыборкаОснование.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Файл) Тогда
					Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							Выборка.Файл, "ПометкаУдаления") = Ложь Тогда
						ФайлОбъект = Выборка.Файл.ПолучитьОбъект();
						ФайлОбъект.УстановитьПометкуУдаления(Истина);
						УдаленоФайлов = УдаленоФайлов + 1;
					КонецЕсли; 
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.ФайлВизуализации) Тогда
					Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							Выборка.ФайлВизуализации, "ПометкаУдаления") = Ложь Тогда
					ФайлОбъект = Выборка.ФайлВизуализации.ПолучитьОбъект();
					ФайлОбъект.УстановитьПометкуУдаления(Истина);
					УдаленоФайлов = УдаленоФайлов + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(ОбъектОснование,
				Перечисления.СобытияОбменаС1САрхивом.Прочее,
				НСтр("ru = 'Удалены файлы документа, переданного в 1С:Архив'"),,
				УниверсальноеВремя(ТекущаяДатаСеанса));
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Удаление файлов документа, переданного в 1С:Архив'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Информация,
				ОбъектОснование.Метаданные(),
				ОбъектОснование,
				СтрШаблон(НСтр("ru = 'Удаление выполнено успешно. Удалено %1 файлов.'"), УдаленоФайлов));
			
			ЗафиксироватьТранзакцию();
			
		Исключение 
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при обработке документа %1: %2'"),
				ПолучитьНавигационнуюСсылку(ОбъектОснование),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Удаление файлов документов'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектОснование.Метаданные(),
				ОбъектОснование.Ссылка,
				ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет запланированные отложенные операции по передаче документов в архив (удаление данных объекта).
//
// Параметры:
//  ДокументыДляОбработки - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА,
//    Массив из ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - документы для обработки.
//  Немедленно - Булево - если Ложь, то задание записывается в очередь, удаление выполняется отложенно.
//
Процедура ОтменитьУдалениеДанныхДокументовПринятыхВАрхив(Знач ДокументыДляОбработки) Экспорт
	
	Если ТипЗнч(ДокументыДляОбработки) <> Тип("Массив") Тогда
		ДокументыДляОбработки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыДляОбработки);
	КонецЕсли;
	
	ДопСведения = РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива
		.ИмяОперацииУдаленияДанныхПринятогоОбъекта();
	Для Каждого Документ Из ДокументыДляОбработки Цикл
		РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива.Удалить(Документ, ДопСведения);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает ссылку на физ. лицо текущего пользователя.
//
// Возвращаемое значение: 
//   ОпределяемыйТип.ФизическоеЛицоБИА - физ. лицо.
// 
Функция ФизЛицоТекущегоПользователя() Экспорт
	
	ФизЛицо = Неопределено;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		РеквизитПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
		Если ЗначениеЗаполнено(РеквизитПользователя)
				И Метаданные.ОпределяемыеТипы.ФизическоеЛицоБИА.Тип.СодержитТип(ТипЗнч(РеквизитПользователя)) Тогда
			ФизЛицо = РеквизитПользователя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФизЛицо;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
// 
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбменС1САрхивом;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИнтеграцияС1САрхивом;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбработкаОчередиОперацийСДокументамиДля1САрхива;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИнтеграцияС1САрхивом;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
// 
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(
		Метаданные.РегламентныеЗадания.ОбменС1САрхивом.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(
		Метаданные.РегламентныеЗадания.ОбработкаОчередиОперацийСДокументамиДля1САрхива.ИмяМетода);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
// 
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОбменС1САрхивом.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОбработкаОчередиОперацийСДокументамиДля1САрхива.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьИДоступностьКоманд(Форма) Экспорт
	
#Если Не ВнешнееСоединение Тогда

	СтандартнаяОбработка = Истина;
	ОбменСАрхивомПереопределяемый.УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка);
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ОбъектИзФормы(Форма);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(,, Ложь);
	ОтправкаДоступнаПоРеквизитам = Не Объект.ПометкаУдаления
		И (Не ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта)
			Или МетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить
			Или Объект.Проведен);
	ЭтоАдминистраторОбмена = РольДоступна(Метаданные.Роли.АдминистрированиеОбменаС1САрхивом);
	ОтправкаДоступнаПоПравам = ЭтоПолноправныйПользователь Или ЭтоАдминистраторОбмена
		Или РольДоступна(Метаданные.Роли.ОтправкаДокументовВ1САрхив);
	ОтменаДоступнаБезОграничений = ЭтоПолноправныйПользователь Или ЭтоАдминистраторОбмена;
	ОтзывДоступенБезОграничений = ЭтоПолноправныйПользователь Или ЭтоАдминистраторОбмена;
	Если ОтправкаДоступнаПоПравам
			И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		ОтправкаДоступнаПоПравам = ОтправкаДоступнаПоПравам
			И МодульУправлениеДоступом.ИзменениеРазрешено(Объект.Ссылка, АвторизованныйПользователь);
	КонецЕсли;
	
	ТаблицаДокументовБИА = Форма.ТаблицаДокументовБИА;
	ОтмеченКОтправке = ТаблицаДокументовБИА.Количество() > 0;
	СтрокиВыгруженныхДокументов = ТаблицаДокументовБИА.НайтиСтроки(Новый Структура("Выгружен", Истина));
	ЕстьВыгруженные = СтрокиВыгруженныхДокументов.Количество() > 0;
	
	ВидимостьОтправить = ОтправкаДоступнаПоПравам И ОтправкаДоступнаПоРеквизитам И Не ОтмеченКОтправке;
	ВидимостьИстория = РегистрыСведений.ИсторияОбменаС1САрхивом.ЕстьЗаписиПоОбъекту(Объект.Ссылка);
	ВидимостьОтменить = Ложь;
	ВидимостьОтозвать = Ложь;
	Если ОтправкаДоступнаПоПравам И ОтмеченКОтправке Тогда
		Если ЕстьВыгруженные Тогда
			ВидимостьОтозвать = ОтзывДоступенБезОграничений;
		ИначеЕсли ОтменаДоступнаБезОграничений Тогда
			ВидимостьОтменить = Истина;
		Иначе
			ЕстьЧужиеДокументы = Ложь;
			Для Каждого СтрокаДокумента Из ТаблицаДокументовБИА Цикл
				Если СтрокаДокумента.Автор <> АвторизованныйПользователь Тогда
					ЕстьЧужиеДокументы = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ВидимостьОтменить = Не ЕстьЧужиеДокументы;
		КонецЕсли;
	КонецЕсли;
	
	КнопкаОтправить = Форма.Элементы.Найти(ОбменСАрхивомКлиентСервер.ИмяКомандыОтправитьВ1САрхив());
	Если КнопкаОтправить <> Неопределено Тогда
		КнопкаОтправить.Видимость = ВидимостьОтправить;
	КонецЕсли;
	
	КнопкаОтменить = Форма.Элементы.Найти(ОбменСАрхивомКлиентСервер.ИмяКомандыОтменитьОтправкуВ1САрхив());
	Если КнопкаОтменить <> Неопределено Тогда
		КнопкаОтменить.Видимость = ВидимостьОтменить;
	КонецЕсли;
	
	КнопкаИстория = Форма.Элементы.Найти(ОбменСАрхивомКлиентСервер.ИмяКомандыИсторияОбмена());
	Если КнопкаИстория <> Неопределено Тогда
		КнопкаИстория.Видимость = ВидимостьИстория;
	КонецЕсли;
	
	КнопкаОтозвать = Форма.Элементы.Найти(ОбменСАрхивомКлиентСервер.ИмяКомандыОтозватьИз1САрхива());
	Если КнопкаОтозвать <> Неопределено Тогда
		КнопкаОтозвать.Видимость = ВидимостьОтозвать;
	КонецЕсли;
	
#Иначе
	ВызватьИсключение НСтр(
		"ru = 'Метод ""ОбменСАрхивом.УстановитьВидимостьИДоступностьКоманд"" недоступен во внешнем соединении.'");
#КонецЕсли
	
КонецПроцедуры

Процедура ЗаполнитьДокументыБИАНаФорме(Форма, Знач ПараметрыРазмещения = Неопределено) Экспорт
	
#Если Не ВнешнееСоединение Тогда

	Если Не ЭтоФормаОбъекта(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	// Удаление элементов формы.
	ИмяГруппы = "ГруппаОбменС1САрхивом";
	ГруппаОбменС1САрхивом = Элементы.Найти(ИмяГруппы);
	ЭтоПовторноеЗаполнение = ГруппаОбменС1САрхивом <> Неопределено;
	Если ЭтоПовторноеЗаполнение Тогда
		Форма.Элементы.Удалить(ГруппаОбменС1САрхивом);
		КомандыКУдалению = Новый Массив;
		Для Каждого Команда Из Форма.Команды Цикл
			Если СтрНайти(Команда.Имя, "СкачатьКонтейнерДокументаИз1САрхива") > 0 Тогда
				КомандыКУдалению.Добавить(Команда);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Команда Из КомандыКУдалению Цикл
			Форма.Команды.Удалить(Команда);
		КонецЦикла;
	КонецЕсли;
	
	// Добавление реквизитов формы.
	Объект = ОбъектИзФормы(Форма);
	ТабДокументовБИА = ТаблицаДокументовБИА(Объект.Ссылка);
	Если ЭтоПовторноеЗаполнение Тогда
		Форма.ТаблицаДокументовБИА.Очистить();
	Иначе
		ДобавляемыеРеквизиты = Новый Массив;
		РеквизитТаблицаБИА = Новый РеквизитФормы("ТаблицаДокументовБИА",
			Новый ОписаниеТипов("ТаблицаЗначений"), "", НСтр("ru = 'Таблица документов БИА'"));
		Для Каждого Колонка Из ТабДокументовБИА.Колонки Цикл
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
				Колонка.Имя, Колонка.ТипЗначения, "ТаблицаДокументовБИА"));
		КонецЦикла;
		РеквизитДанныеБИА = Новый РеквизитФормы("ДанныеБИА", Новый ОписаниеТипов(), "",
			НСтр("ru = 'Вспомогательные данные для интеграции с 1С:Архивом'"));
		ДобавляемыеРеквизиты.Добавить(РеквизитТаблицаБИА);
		ДобавляемыеРеквизиты.Добавить(РеквизитДанныеБИА);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Если ПараметрыРазмещения = Неопределено Тогда
			ПараметрыРазмещения = ПараметрыРазмещенияЭлементов();
		КонецЕсли;
		Форма.ДанныеБИА = Новый Структура;
		Форма.ДанныеБИА.Вставить("ПараметрыРазмещения", ПараметрыРазмещения);
	КонецЕсли;
	Форма.ТаблицаДокументовБИА.Загрузить(ТабДокументовБИА);
	
	// Добавление элементов и команд.
	МестоРазмещенияЭлементов = Форма.ДанныеБИА.ПараметрыРазмещения.ГруппаРазмещенияЭлементов;
	Если МестоРазмещенияЭлементов = Неопределено Тогда
		МестоРазмещенияЭлементов = Форма;
	КонецЕсли;
	ГруппаОбменС1САрхивом = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), МестоРазмещенияЭлементов);
	ГруппаОбменС1САрхивом.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОбменС1САрхивом.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОбменС1САрхивом.ОтображатьЗаголовок = Ложь; 
	ГруппаОбменС1САрхивом.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаОбменС1САрхивом.ЦветФона = ЦветаСтиля.ЦветФонаИнформацииОбОбменеС1САрхивом;
	Если МестоРазмещенияЭлементов = Форма Тогда
		ПервыйЭлемент = Форма.ПодчиненныеЭлементы.Получить(0);
		Форма.Элементы.Переместить(ГруппаОбменС1САрхивом, ГруппаОбменС1САрхивом.Родитель, ПервыйЭлемент);
	КонецЕсли;
	
	КоличествоДокументов = ТабДокументовБИА.Количество();
	Если КоличествоДокументов > 0 Тогда
		Форма.ТолькоПросмотр = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПредставленияСтатусов = Новый Соответствие;
	СтатусыМенеджер = Перечисления.СтатусыОбменаС1САрхивом;
	ПредставленияСтатусов[СтатусыМенеджер.НеГотовКВыгрузке]
		= НСтр("ru = 'ожидает выгрузки в 1С:Архив'");
	ПредставленияСтатусов[СтатусыМенеджер.ГотовКВыгрузке]
		= НСтр("ru = 'ожидает выгрузки в 1С:Архив'");
	ПредставленияСтатусов[СтатусыМенеджер.ОбнаруженыОшибкиПриВыгрузке]
		= НСтр("ru = 'ошибка выгрузки в 1С:Архив'");
	ПредставленияСтатусов[СтатусыМенеджер.ВыгрузкаВыполнена]
		= НСтр("ru = 'выгружен в 1С:Архив'");
	// Пока нет детализации ошибок пакета по документам, статус "ошибка" не выводится.
	ПредставленияСтатусов[СтатусыМенеджер.ОбнаруженыОшибкиПриЗагрузкеВАрхив]
		= НСтр("ru = 'выгружен в 1С:Архив'");
	ПредставленияСтатусов[СтатусыМенеджер.ОбнаруженыОшибкиПриПроверкеВАрхиве]
		= НСтр("ru = 'выгружен в 1С:Архив'");
	ПредставленияСтатусов[СтатусыМенеджер.ЗагрузкаВАрхивВыполнена]
		= НСтр("ru = 'загружен в 1С:Архив'");
	ПредставленияСтатусов[СтатусыМенеджер.ПринятВАрхив]
		= НСтр("ru = 'принят в 1С:Архив'");
		
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(,, Ложь);
	ЭтоАдминистраторОбмена = РольДоступна(Метаданные.Роли.АдминистрированиеОбменаС1САрхивом);
	
	// Заполнение элементов формы.
	ЕстьДоступныеДокументы = Ложь;
	КоличествоОтображаемыхСтрокНаФорме = 3;
	ПомещаютсяВсеДокументы = КоличествоДокументов <= КоличествоОтображаемыхСтрокНаФорме;
	КоличествоОтображаемыхДокументов = ?(ПомещаютсяВсеДокументы,
		КоличествоДокументов, КоличествоОтображаемыхСтрокНаФорме - 1);
	
	Для НомерСтроки = 1 По КоличествоОтображаемыхДокументов Цикл
		
		Индекс = НомерСтроки - 1;
		СтрокаДокумента = Форма.ТаблицаДокументовБИА[Индекс];
		ИндексСтрокой = Формат(Индекс, "ЧГ=;ЧН=");
		
		ГруппаДокумент = Форма.Элементы.Добавить(
			"ГруппаДокументБИА" + ИндексСтрокой, Тип("ГруппаФормы"), ГруппаОбменС1САрхивом);
		ГруппаДокумент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДокумент.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаДокумент.ОтображатьЗаголовок = Ложь; 
		ГруппаДокумент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ЭлементДокументаБИА = Форма.Элементы.Добавить(
			ОбменСАрхивомКлиентСервер.ИмяЭлементаДокументБИА() + ИндексСтрокой,
			Тип("ДекорацияФормы"), ГруппаДокумент);
		ЭлементДокументаБИА.Вид = ВидДекорацииФормы.Надпись;
 		Если ЭтоПолноправныйПользователь Или ЭтоАдминистраторОбмена
				Или СтрокаДокумента.Автор = АвторизованныйПользователь Тогда
			ЕстьДоступныеДокументы = Истина;
			ЭлементДокументаБИА.Гиперссылка = Истина;
			ЭлементДокументаБИА.УстановитьДействие("Нажатие", "Подключаемый_ИнтеграцияС1САрхивом_Нажатие");
		КонецЕсли;
		
		ПредставлениеСтатуса = ?(СтрокаДокумента.Уничтожен,
			НСтр("ru = 'уничтожен в 1С:Архиве'"),
			ПредставленияСтатусов[СтрокаДокумента.Статус]);
		
		Если КоличествоДокументов = 1 Тогда
			ЭлементДокументаБИА.Заголовок = СтрШаблон(НСтр("ru = 'Документ %1'"), ПредставлениеСтатуса);
		Иначе
			ЭлементДокументаБИА.Заголовок = СтрШаблон(НСтр("ru = '%1: %2'"),
				Строка(СтрокаДокумента.ВидДокумента), ПредставлениеСтатуса);
		КонецЕсли;
		
		ЭлементДокументаБИА.Высота = 1;
		ЭлементДокументаБИА.Ширина = Цел(СтрДлина(ЭлементДокументаБИА.Заголовок) * 0.75);
		ЭлементДокументаБИА.РастягиватьПоВертикали = Ложь;
		ЭлементДокументаБИА.РастягиватьПоГоризонтали = Ложь;
		ЭлементДокументаБИА.АвтоМаксимальнаяШирина = Ложь;
		
		Если СтрокаДокумента.Статус = СтатусыМенеджер.ЗагрузкаВАрхивВыполнена
			Или СтрокаДокумента.Статус = СтатусыМенеджер.ПринятВАрхив Тогда
			
			ИмяКоманды = "СкачатьКонтейнерДокументаИз1САрхива" + Формат(ИндексСтрокой, "ЧГ=");
			КомандаСкачать = Форма.Команды.Добавить(ИмяКоманды);
			КомандаСкачать.Заголовок = НСтр("ru = 'Скачать'");
			КомандаСкачать.Действие = "Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом";
			
			КнопкаСкачать = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаДокумент);
			КнопкаСкачать.Вид = ВидКнопкиФормы.Гиперссылка;
			КнопкаСкачать.ИмяКоманды = ИмяКоманды;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Показать все документы.
	Если Не ПомещаютсяВсеДокументы Тогда
		ИмяКоманды = ОбменСАрхивомКлиентСервер.ИмяКомандыПоказатьВсеДокументыБИА();
		КомандаПоказатьВсе = Форма.Команды.Добавить(ИмяКоманды);
		КомандаПоказатьВсе.Заголовок = СтрШаблон(НСтр("ru = 'Все документы (%1)'"),
			Формат(КоличествоДокументов, "ЧГ="));
		КомандаПоказатьВсе.Действие = "Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом";
		СсылкаПоказатьВсе = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаОбменС1САрхивом);
		СсылкаПоказатьВсе.Вид = ВидКнопкиФормы.Гиперссылка;
		СсылкаПоказатьВсе.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
#Иначе
	ВызватьИсключение НСтр(
		"ru = 'Метод ""ОбменСАрхивом.ЗаполнитьДокументыБИАНаФорме"" недоступен во внешнем соединении.'");
#КонецЕсли
	
КонецПроцедуры

Функция ВерсияФорматаМаксимальная()
	
	ВсеВерсииФормата = ВерсииФорматаДоступные();
	
	Возврат ВсеВерсииФормата[0].Значение;
	
КонецФункции

Функция ИмяСвойстваВерсияФормата()
	
	Возврат "FormatVersion";
	
КонецФункции

Процедура ВыгрузитьДанные(ПараметрыТранспорта)
	
	ОтправитьСообщенияОВерсииФормата(ПараметрыТранспорта);
	
	Если Не ЗначениеЗаполнено(ВерсияФорматаБазыАрхива(Ложь)) Тогда
		Возврат; // Нет информации, в каком формате выгружать данные. Ожидается сообщение с форматом от 1С:Архива.
	КонецЕсли;
	
	СформироватьСообщенияНСИ();
	ОтправитьСообщенияНСИ(ПараметрыТранспорта);
	ОтправитьМЧД(ПараметрыТранспорта);
	
	СформироватьПакетыДокументов();
	ОтправитьПакетыДокументов(ПараметрыТранспорта);
	
КонецПроцедуры

Процедура СформироватьСообщенияНСИ()
	
	КодИсточника = СокрЛП(Константы.ИнтеграцияС1САрхивомКодБазы.Получить());
	ПространствоИменСхемы = ВерсияФорматаДляОтправкиСообщений();
	
	УзелАрхив = ПланыОбмена.ОбменНСИСАрхивом.УзелАрхив();
	ОбъектыДляВыгрузки = ПорцияНСИДляВыгрузки();
	ОбъектыСОшибками = Новый Массив;
	
	Пока ОбъектыДляВыгрузки.Количество() > 0 Цикл
		
		Попытка
			ОбъектыНСИXDTO = ЗаполнитьXDTOОбъектыНСИ(ОбъектыДляВыгрузки);
		Исключение
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбъектыСОшибками, ОбъектыДляВыгрузки);
			ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрацииВыгрузкаНСИ(),
				УровеньЖурналаРегистрации.Ошибка,
				СтрШаблон(НСтр("ru = 'Ошибка выгрузки объектов НСИ ""%1""'"),
					ОбъектыДляВыгрузки[0].Метаданные().ПолноеИмя()),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбъектыДляВыгрузки = ПорцияНСИДляВыгрузки(ОбъектыСОшибками);
			Продолжить;
		КонецПопытки;
		
		Для Каждого СсылкаНСИ Из ОбъектыДляВыгрузки Цикл	
			
			ОбъектНСИXDTO = Неопределено;
			ОшибкаПриФормированииXDTO = "";
			НайденноеЗначение = ОбъектыНСИXDTO[СсылкаНСИ];
			Если ТипЗнч(НайденноеЗначение) = Тип("Строка") Тогда
				ОшибкаПриФормированииXDTO = НайденноеЗначение;
			Иначе
				ОбъектНСИXDTO = НайденноеЗначение;
			КонецЕсли;
			
			НачатьТранзакцию();
			Попытка
				Если ЗначениеЗаполнено(ОшибкаПриФормированииXDTO) Тогда
					ВызватьИсключение ОшибкаПриФормированииXDTO;
				ИначеЕсли ОбъектНСИXDTO <> Неопределено Тогда
					СообщениеXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменСхемы, "Message"));
					СообщениеXDTO.ID = Строка(Новый УникальныйИдентификатор);
					СообщениеXDTO.Date = ТекущаяДатаСеанса();
					СообщениеXDTO.SourceID = КодИсточника;
					СообщениеXDTO.Object.Добавить(ОбъектНСИXDTO);
					
					ЗаписьJSON = Новый ЗаписьJSON;
					ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
					ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, СообщениеXDTO, НазначениеТипаXML.Явное);
					СтрокаJSON = ЗаписьJSON.Закрыть();
					РегистрыСведений.СообщенияДля1САрхива.Добавить(СообщениеXDTO.ID, СтрокаJSON);
				КонецЕсли;
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелАрхив, СсылкаНСИ);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ОбъектыСОшибками.Добавить(СсылкаНСИ);
				ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрацииВыгрузкаНСИ(),
					УровеньЖурналаРегистрации.Ошибка, НСтр("ru = 'Ошибка выгрузки НСИ'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), СсылкаНСИ);
			КонецПопытки;
			
		КонецЦикла;
		
		ОбъектыДляВыгрузки = ПорцияНСИДляВыгрузки(ОбъектыСОшибками);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьСообщенияОВерсииФормата(ПараметрыТранспорта)
	
	ОтправитьСообщения(ПараметрыТранспорта, "ВерсияФормата");
	
КонецПроцедуры

Процедура ОтправитьСообщенияНСИ(ПараметрыТранспорта)
	
	ОтправитьСообщения(ПараметрыТранспорта);
	
КонецПроцедуры

Процедура ОтправитьСообщения(ПараметрыТранспорта, ТипСообщений = Неопределено)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 5000
		|	СообщенияДляАрхива.ИдентификаторСообщения КАК ИдентификаторСообщения,
		|	СообщенияДляАрхива.ТелоСообщения КАК ТелоСообщения,
		|	СообщенияДляАрхива.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	РегистрСведений.СообщенияДля1САрхива КАК СообщенияДляАрхива
		|ГДЕ
		|	СообщенияДляАрхива.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)
		|	И СообщенияДляАрхива.КоличествоПопытокОбработки <= &ЛимитКолПопыток
		|	И ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания");
	Запрос.УстановитьПараметр("ЛимитКолПопыток", 3);
	
	Если ТипСообщений = "ВерсияФормата" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"И ИСТИНА", "И СообщенияДляАрхива.ИдентификаторСообщения = &ИмяСвойстваВерсияФормата");
		Запрос.УстановитьПараметр("ИмяСвойстваВерсияФормата", ИмяСвойстваВерсияФормата());
	ИначеЕсли ТипСообщений <> Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Неизвестный тип сообщений: %1'"), ТипСообщений);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ОтметкаВремениПредыдущая = "";
	ДополнениеКОтметке = 0;
	
	ВременнаяПапка = ПолучитьИмяВременногоФайла("") + ПолучитьРазделительПути();
	СоздатьКаталог(ВременнаяПапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			
			ОтметкаВремениТекущая = ТекущаяОтметкаВремени();
			ИмяФайлаБезРасширения = ОтметкаВремениТекущая;
			Если ОтметкаВремениТекущая = ОтметкаВремениПредыдущая Тогда
				ДополнениеКОтметке = ДополнениеКОтметке + 1;
				ИмяФайлаБезРасширения = ОтметкаВремениТекущая + "_" + ДополнениеКОтметке;
			Иначе
				ОтметкаВремениПредыдущая = ОтметкаВремениТекущая;
				ДополнениеКОтметке = 0;
			КонецЕсли;
			ИмяФайла = ВременнаяПапка + ИмяФайлаБезРасширения + ".json";
			
			ТекстСобщения = Выборка.ТелоСообщения.Получить();
			ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
			ЗаписьТекста.Записать(ТекстСобщения);
			ЗаписьТекста.Закрыть();
			
			ОбменСАрхивомТранспорт.ОтправитьФайл(ИмяФайла, ПараметрыТранспорта);
			
			РегистрыСведений.СообщенияДля1САрхива.ОтметитьОтправку(Выборка.ИдентификаторСообщения);
			
			Если Выборка.ИдентификаторСообщения = ИмяСвойстваВерсияФормата() Тогда
				ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрацииОтправкаСообщений(),
					УровеньЖурналаРегистрации.Информация,
					НСтр("ru = 'Отправка информации о версии формата'"),,
					Пользователи.ТекущийПользователь());
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПолныйТекстОшибки = СтрШаблон(НСтр("ru = 'Обнаружены ошибки при отправке сообщения %1:
				|%2'"),
				Выборка.ИдентификаторСообщения, ТекстОшибки);
			РегистрыСведений.СообщенияДля1САрхива.ЗафиксироватьНеудачнуюПопытку(
				Выборка.ИдентификаторСообщения, ТекстОшибки);
			ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрацииОтправкаСообщений(),
				УровеньЖурналаРегистрации.Ошибка, НСтр("ru = 'Ошибка отправки сообщения'"),
				ПолныйТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
	УдалитьВременныеФайлы(ВременнаяПапка);
	
КонецПроцедуры

Процедура СформироватьПакетыДокументов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Истина;
	ОбменСАрхивомПереопределяемый.СформироватьПакетыДокументов(СтандартнаяОбработка);
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// Сначала вычисляются объекты-основания, по которым выгружаются документы.
	// Иначе документы одного объекта могут попасть в разные пакеты.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 5000
		|	ДокументыБИА.ОбъектОснование КАК Объект
		|ПОМЕСТИТЬ ВыгружаемыеОбъекты
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТЧ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|			ПО ПакетыТЧ.Ссылка = Пакеты.Ссылка
		|		ПО ДокументыБИА.Ссылка = ПакетыТЧ.Документ
		|			И (НЕ Пакеты.ПометкаУдаления)
		|ГДЕ
		|	НЕ ДокументыБИА.ПометкаУдаления
		|	И ПакетыТЧ.Документ ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыБИА.ДатаСоздания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.Организация) КАК КолОрганизаций,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.ГрифДоступа) КАК КолГрифов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.Подразделение) КАК КолПодразделений
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыгружаемыеОбъекты КАК ВыгружаемыеОбъекты
		|		ПО ДокументыБИА.ОбъектОснование = ВыгружаемыеОбъекты.Объект
		|ГДЕ
		|	НЕ ДокументыБИА.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыБИА.ОбъектОснование
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.Организация) > 1
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.Подразделение) > 1
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.ГрифДоступа) > 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыБИА.Ссылка КАК Документ,
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование,
		|	ДокументыБИА.Организация КАК Организация,
		|	ДокументыБИА.Подразделение КАК Подразделение,
		|	ДокументыБИА.ГрифДоступа КАК ГрифДоступа,
		|	ДокументыБИА.Дата КАК Дата
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыгружаемыеОбъекты КАК ВыгружаемыеОбъекты
		|		ПО ДокументыБИА.ОбъектОснование = ВыгружаемыеОбъекты.Объект
		|ГДЕ
		|	НЕ ДокументыБИА.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Подразделение,
		|	ГрифДоступа,
		|	ОбъектОснование,
		|	ДокументыБИА.Дата");
	
	МаксКоличествоДокументовВПакете = МаксКоличествоДокументовВПакете();
	
	СтатусПоУмолчанию = Перечисления.СтатусыОбменаС1САрхивом.ГотовКВыгрузке;
	Если Константы.ПодтверждатьОтправкуПакетовВ1САрхив.Получить() = Истина Тогда
		СтатусПоУмолчанию = Перечисления.СтатусыОбменаС1САрхивом.НеГотовКВыгрузке;
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Пока Не РезультатыЗапроса[2].Пустой() Цикл
	
		ОбъектыСНесколькимиЗначениямиГруппировок = Новый Соответствие; // Документы каждого такого объекта попадут в отдельный пакет.
		ТабОбъектовСНесколькимиЗначениямиГруппировок = РезультатыЗапроса[1].Выгрузить();
		Для Каждого Стр Из ТабОбъектовСНесколькимиЗначениямиГруппировок Цикл
			ОбъектыСНесколькимиЗначениямиГруппировок[Стр.ОбъектОснование] = Истина;
		КонецЦикла;
		
		ТаблицаВыборки = РезультатыЗапроса[2].Выгрузить();
		ТаблицаВыборки.Колонки.Добавить("ЗначениеДляГруппировкиПоПакетам");
		Для Каждого Стр Из ТаблицаВыборки Цикл
			Если ОбъектыСНесколькимиЗначениямиГруппировок[Стр.ОбъектОснование] <> Неопределено Тогда
				Стр.ЗначениеДляГруппировкиПоПакетам = Стр.ОбъектОснование;
			Иначе
				Стр.ЗначениеДляГруппировкиПоПакетам = "" 
					+ ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Стр.Организация)),
						Стр.Организация.УникальныйИдентификатор(), Стр.Организация)
					+ ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Стр.Подразделение)),
						Стр.Подразделение.УникальныйИдентификатор(), Стр.Подразделение)
					+ ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Стр.ГрифДоступа)),
						Стр.ГрифДоступа.УникальныйИдентификатор(), Стр.ГрифДоступа);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаВыборки.Сортировать("ЗначениеДляГруппировкиПоПакетам, ОбъектОснование");
		
		Счетчик = 0;
		ПакетОбъект = Неопределено;
		ТекЗначениеДляГруппировкиПоПакетам = Неопределено;
		КолСтрок = ТаблицаВыборки.Количество();
		
		Для ИндексСтроки = 0 По КолСтрок - 1 Цикл
			
			СтрокаВыборки = ТаблицаВыборки[ИндексСтроки];
			ПакетЗаполнен = СтрокаВыборки.ЗначениеДляГруппировкиПоПакетам <> ТекЗначениеДляГруппировкиПоПакетам;
			Если Не ПакетЗаполнен И Счетчик >= МаксКоличествоДокументовВПакете Тогда
				ПакетЗаполнен = Истина;
				Если ИндексСтроки < КолСтрок - 1 Тогда
					// Документы, созданные на основании одного объекта, должны попасть в один пакет.
					СледующаяСтрока = ТаблицаВыборки[ИндексСтроки + 1];
					Если СтрокаВыборки.ОбъектОснование = СледующаяСтрока.ОбъектОснование Тогда
						ПакетЗаполнен = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
			Если ПакетЗаполнен Тогда
				
				Если ПакетОбъект <> Неопределено И ПакетОбъект.Документы.Количество() > 0 Тогда
					ПакетОбъект.Записать();
				КонецЕсли;
				
				ПакетОбъект = Справочники.ПакетыДокументовДля1САрхива.СоздатьЭлемент();
				ПакетОбъект.Идентификатор = Новый УникальныйИдентификатор;
				ПакетОбъект.СтатусОбменаСАрхивом = СтатусПоУмолчанию;
				ПакетОбъект.Организация = СтрокаВыборки.Организация;
				ПакетОбъект.Подразделение = СтрокаВыборки.Подразделение;
				ПакетОбъект.ГрифДоступа = СтрокаВыборки.ГрифДоступа;
				ПакетОбъект.ДатаСоздания = ТекущаяДатаСеанса();
				Если ОбъектыСНесколькимиЗначениямиГруппировок[СтрокаВыборки.ОбъектОснование] <> Неопределено Тогда
					НайденнаяСтрока = ТабОбъектовСНесколькимиЗначениямиГруппировок.Найти(СтрокаВыборки.ОбъектОснование);
					Если НайденнаяСтрока.КолОрганизаций > 1 Тогда
						ПакетОбъект.Организация = Неопределено;
					КонецЕсли;
					Если НайденнаяСтрока.КолПодразделений > 1 Тогда
						ПакетОбъект.Подразделение = Неопределено;
					КонецЕсли;
					Если НайденнаяСтрока.КолГрифов > 1 Тогда
						ПакетОбъект.ГрифДоступа = Неопределено;
					КонецЕсли;
				КонецЕсли;
				
				Счетчик = 0;
				ТекЗначениеДляГруппировкиПоПакетам = СтрокаВыборки.ЗначениеДляГруппировкиПоПакетам;
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			СтрокаПакета = ПакетОбъект.Документы.Добавить();
			СтрокаПакета.Документ = СтрокаВыборки.Документ;
			
		КонецЦикла;
		
		Если ПакетОбъект <> Неопределено И ПакетОбъект.Документы.Количество() > 0 Тогда
			ПакетОбъект.Записать();
		КонецЕсли;
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьПакетыДокументов(ПараметрыТранспорта)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	ПакетыДокументовДля1САрхива.Ссылка КАК Ссылка,
		|	ПакетыДокументовДля1САрхива.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива КАК ПакетыДокументовДля1САрхива
		|ГДЕ
		|	ПакетыДокументовДля1САрхива.СтатусОбменаСАрхивом = ЗНАЧЕНИЕ(Перечисление.СтатусыОбменаС1САрхивом.ГотовКВыгрузке)
		|	И НЕ ПакетыДокументовДля1САрхива.ПометкаУдаления
		|	И НЕ ПакетыДокументовДля1САрхива.Ссылка В (&ПакетыСОшибкамиВыгрузки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПакетыДокументовДля1САрхива.ДатаСоздания");
	
	ПакетыСОшибкамиВыгрузки = Новый Массив;
	ОтметкаВремениПредыдущая = "";
	ДополнениеКОтметке = 0;
	
	Запрос.УстановитьПараметр("ПакетыСОшибкамиВыгрузки", ПакетыСОшибкамиВыгрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ПакетыДокументовДля1САрхива");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			НачатьТранзакцию();
			Попытка
				Блокировка.Заблокировать();
				ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
				
				ПолноеИмяВременногоФайлаПакета = ФайлПакетаДокументов(Выборка.Ссылка);
				ПакетОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если ПолноеИмяВременногоФайлаПакета = Неопределено Тогда
					// В пакете нет не помеченных на удаление документов.
					ПакетОбъект.УстановитьПометкуУдаления(Истина);
					ЗафиксироватьТранзакцию();
					Продолжить;
				КонецЕсли;
				
				ОтметкаВремениТекущая = ТекущаяОтметкаВремени();
				ИмяФайлаПоФорматуБезРасширения = ОтметкаВремениТекущая;
				Если ОтметкаВремениТекущая = ОтметкаВремениПредыдущая Тогда
					ДополнениеКОтметке = ДополнениеКОтметке + 1;
					ИмяФайлаПоФорматуБезРасширения = СтрШаблон("%1_%2", ОтметкаВремениТекущая, ДополнениеКОтметке);
				Иначе
					ОтметкаВремениПредыдущая = ОтметкаВремениТекущая;
					ДополнениеКОтметке = 0;
				КонецЕсли;
				ФайлПакета = Новый Файл(ПолноеИмяВременногоФайлаПакета);
				ПолноеИмяФайлаПакетаПоФормату = СтрШаблон(НСтр("ru = '%1%2.zip'"),
					ФайлПакета.Путь, ИмяФайлаПоФорматуБезРасширения);
				ПереместитьФайл(ПолноеИмяВременногоФайлаПакета, ПолноеИмяФайлаПакетаПоФормату);
				
				ПакетОбъект.СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ВыгрузкаВыполнена;
				ПакетОбъект.Записать();
				
				ОбменСАрхивомТранспорт.ОтправитьФайл(ПолноеИмяФайлаПакетаПоФормату, ПараметрыТранспорта);
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ПакетыСОшибкамиВыгрузки.Добавить(Выборка.Ссылка);
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка выгрузки пакета %1: %2'"),
					Выборка.Идентификатор,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка, НСтр("ru = 'Ошибка выгрузки пакета'"),
					ТекстОшибки, Выборка.Ссылка);
				УстановитьСтатусОшибкиВыгрузкиПакета(Выборка.Ссылка, ТекстОшибки);
			КонецПопытки;
			
		КонецЦикла;
		Запрос.УстановитьПараметр("ПакетыСОшибкамиВыгрузки", ПакетыСОшибкамиВыгрузки);
		РезультатЗапроса = Запрос.Выполнить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДокументВПакет(ВыборкаДокумент, ПакетДокументовXDTO, ЗаписьZipФайлаПакетДокументов,
			ВременнаяПапка, ПорядковыйНомерКонтейнера, ТекстОшибки) Экспорт
	
#Если Не ВнешнееСоединение Тогда
	
	ПространствоИменСхемы = ВерсияФорматаДляОтправкиСообщений();
	РеквизитыДокументаМетаданные = ВыборкаДокумент.Ссылка.Метаданные().Реквизиты;
	ТипыXDTOПоТипамЗначений = ТипыXDTOПоТипамЗначений();

	ИмяZipФайлаКонтейнера = "DocumentContainer" + Строка(ПорядковыйНомерКонтейнера);
	ИмяZipФайлаКонтейнераПолное = ВременнаяПапка + ИмяZipФайлаКонтейнера + ".zip";
	ЗаписьZipФайлаКонтейнер = Новый ЗаписьZipФайла(ИмяZipФайлаКонтейнераПолное);
	
	КонтейнерДокументаXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(
		ПространствоИменСхемы, "DocumentContainer"));
	СвойстваКонтейнераXDTO = КонтейнерДокументаXDTO.Свойства();
	ЗаполнитьЗначенияСвойств(КонтейнерДокументаXDTO, ВыборкаДокумент);
	КонтейнерДокументаXDTO.ID = ИдентификаторСсылки(ВыборкаДокумент.Ссылка);
	КонтейнерДокументаXDTO.DocumentTypeID = ИдентификаторСсылки(ВыборкаДокумент.ВидДокумента);
	КонтейнерДокументаXDTO.OrganizationID = ИдентификаторСсылки(ВыборкаДокумент.Организация);
	КонтейнерДокументаXDTO.DepartmentID = ?(ЗначениеЗаполнено(ВыборкаДокумент.Подразделение),
		ИдентификаторСсылки(ВыборкаДокумент.Подразделение), "");
	КонтейнерДокументаXDTO.SecurityLevelID = ?(ЗначениеЗаполнено(ВыборкаДокумент.ГрифДоступа),
		ИдентификаторСсылки(ВыборкаДокумент.ГрифДоступа), "");
	Если СвойстваКонтейнераXDTO.Получить("OrganizationName") <> Неопределено Тогда
		КонтейнерДокументаXDTO.OrganizationName = Строка(ВыборкаДокумент.Организация);
	КонецЕсли;
	Если СвойстваКонтейнераXDTO.Получить("DocumentTypeName") <> Неопределено Тогда
		КонтейнерДокументаXDTO.DocumentTypeName = Строка(ВыборкаДокумент.ВидДокумента);
	КонецЕсли;
	Если СвойстваКонтейнераXDTO.Получить("DepartmentName") <> Неопределено Тогда
		КонтейнерДокументаXDTO.DepartmentName = Строка(ВыборкаДокумент.Подразделение);
	КонецЕсли;
	Если СвойстваКонтейнераXDTO.Получить("SecurityLevelName") <> Неопределено Тогда
		КонтейнерДокументаXDTO.SecurityLevelName = Строка(ВыборкаДокумент.ГрифДоступа);
	КонецЕсли;
	
	// Визы.
	ВыборкаВизы = ВыборкаДокумент.ВизыСогласования.Выбрать();
	ТипXDTOВизы = СвойстваКонтейнераXDTO.Получить("Visas").Тип;
	Пока ВыборкаВизы.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаВизы.Автор)
				Или Не ЗначениеЗаполнено(ВыборкаВизы.Результат) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаВиз = ФабрикаXDTO.Создать(ТипXDTOВизы);
		СтрокаВиз.ReviewerID = ИдентификаторСсылки(ВыборкаВизы.Автор);
		СтрокаВиз.Date = ВыборкаВизы.Дата;
		СтрокаВиз.Result = Метаданные.Перечисления.РезультатыСогласованияБИА.ЗначенияПеречисления[
			Перечисления.РезультатыСогласованияБИА.Индекс(ВыборкаВизы.Результат)].Имя;
		СтрокаВиз.Comment = ВыборкаВизы.Комментарий;
		КонтейнерДокументаXDTO.Visas.Добавить(СтрокаВиз);
	КонецЦикла;
	
	// Резолюции.
	ВыборкаРезолюции = ВыборкаДокумент.Резолюции.Выбрать();
	ТипXDTOРезолюции = СвойстваКонтейнераXDTO.Получить("Resolutions").Тип;
	Пока ВыборкаРезолюции.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаРезолюции.Автор) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРезолюций = ФабрикаXDTO.Создать(ТипXDTOРезолюции);
		СтрокаРезолюций.ReviewerID = ИдентификаторСсылки(ВыборкаРезолюции.Автор);
		СтрокаРезолюций.Date = ВыборкаРезолюции.Дата;
		СтрокаРезолюций.Text = ВыборкаРезолюции.ТекстРезолюции;
		КонтейнерДокументаXDTO.Resolutions.Добавить(СтрокаРезолюций);
	КонецЦикла;
	
	// Прочие реквизиты - коллекция OtherProperties.
	ТаблицаПрочихСвойств = ВыборкаДокумент.ПрочиеСвойства.Выгрузить();
	ТипXDTOСтрокиДопСвойства = СвойстваКонтейнераXDTO.Получить("OtherProperties").Тип;
	ПрочиеРеквизиты = СтрРазделить(
		"Контрагент,Проект,Содержание,Валюта,Сумма,СуммаНДС,ДатаНачалаДействия,ДатаОкончанияДействия,Комментарий", ",");
	Для Каждого ИмяРеквизита Из ПрочиеРеквизиты Цикл
		МетаданныеРеквизита = РеквизитыДокументаМетаданные.Найти(ИмяРеквизита);
		Если МетаданныеРеквизита = Неопределено Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС
				+ СтрШаблон(НСтр("ru = 'неожиданное имя реквизита %1'"), ИмяРеквизита);
			Продолжить;
		КонецЕсли;
		СтрокаСвойства = ТаблицаПрочихСвойств.Добавить();
		СтрокаСвойства.ИмяСвойства = МетаданныеРеквизита.Имя;
		СтрокаСвойства.ПредставлениеСвойства = МетаданныеРеквизита.Синоним;
		СтрокаСвойства.Значение = ВыборкаДокумент[ИмяРеквизита];
	КонецЦикла;
	Для Каждого СтрокаСвойства Из ТаблицаПрочихСвойств Цикл
		СтрокаРеквизита = ФабрикаXDTO.Создать(ТипXDTOСтрокиДопСвойства);
		СтрокаРеквизита.ID = СтрокаСвойства.ИмяСвойства;
		СтрокаРеквизита.Name = СтрокаСвойства.ПредставлениеСвойства;
		ТипИЗначение = ТипИЗначениеДопСвойстваДляВыгрузки(СтрокаСвойства.Значение, ТипыXDTOПоТипамЗначений);
		СтрокаРеквизита.Type = ТипИЗначение.Тип;
		СтрокаРеквизита.Value = ТипИЗначение.Значение;
		КонтейнерДокументаXDTO.OtherProperties.Добавить(СтрокаРеквизита);
	КонецЦикла;
	
	// Доп. таб. части - коллекция AdditionalTables.
	Если СвойстваКонтейнераXDTO.Получить("AdditionalTables") <> Неопределено Тогда
		ТаблицаПрочихТабЧастей = ВыборкаДокумент.ДополнительныеТабЧасти.Выгрузить();
		ТипXDTOСтрокиДопТабЧасти = СвойстваКонтейнераXDTO.Получить("AdditionalTables").Тип;
		Для Каждого СтрокаИсточника Из ТаблицаПрочихТабЧастей Цикл
			СтрокаДопТЧ = ФабрикаXDTO.Создать(ТипXDTOСтрокиДопТабЧасти);
			СтрокаДопТЧ.TableName = СтрокаИсточника.ИмяТаблицы;
			СтрокаДопТЧ.ColumnName = СтрокаИсточника.ИмяКолонки;
			СтрокаДопТЧ.RowNumber = СтрокаИсточника.НомерСтрокиИсточника;
			ТипИЗначение = ТипИЗначениеДопСвойстваДляВыгрузки(СтрокаИсточника.Значение, ТипыXDTOПоТипамЗначений);
			СтрокаДопТЧ.Type = ТипИЗначение.Тип;
			СтрокаДопТЧ.Value = ТипИЗначение.Значение;
			КонтейнерДокументаXDTO.AdditionalTables.Добавить(СтрокаДопТЧ);
		КонецЦикла;
	КонецЕсли;
	
	// Субъекты ПД.
	Если Не ВыборкаДокумент.СубъектыПерсональныхДанных.Пустой() Тогда
		Субъекты = ВыборкаДокумент.СубъектыПерсональныхДанных.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
		ТипXDTOСтрокиСубъекта = СвойстваКонтейнераXDTO.Получить("PersonalDataSubjects").Тип;
		Для Каждого ФизЛицо Из Субъекты Цикл
			СтрокаСубъекта = ФабрикаXDTO.Создать(ТипXDTOСтрокиСубъекта);
			СтрокаСубъекта.PersonID = ИдентификаторСсылки(ФизЛицо);
			КонтейнерДокументаXDTO.PersonalDataSubjects.Добавить(СтрокаСубъекта);
		КонецЦикла;
	КонецЕсли;
	
	// Связи.
	ТипXDTOСвязи = СвойстваКонтейнераXDTO.Получить("Links").Тип;
	ТаблицаСвязей = ВыборкаДокумент.Связи.Выгрузить();
	ПометкиУдаленияСвязанныхДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		ТаблицаСвязей.ВыгрузитьКолонку("СвязанныйДокумент"), "ПометкаУдаления");
	Для Каждого СтрокаСвязи Из ТаблицаСвязей Цикл
		СвязанныйДокумент = СтрокаСвязи.СвязанныйДокумент;
		СвязаннаяСтрока = СтрокаСвязи.СвязаннаяСтрока;
		Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда
			Если ПометкиУдаленияСвязанныхДокументов[СвязанныйДокумент] = Истина Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(СвязаннаяСтрока) Тогда
			Продолжить;
		КонецЕсли;
		// Прямая.
		Связь = ФабрикаXDTO.Создать(ТипXDTOСвязи);
		СвойстваСвязиXDTO = Связь.Свойства();
		Если СвойстваСвязиXDTO.Получить("TypeID") <> Неопределено Тогда
			Связь.TypeID = СтрокаСвязи.ТипСвязиИдентификатор;
		КонецЕсли;
		Связь.TypeName = СтрокаСвязи.ТипСвязиНаименование;
		Связь.LinkedDocumentID = ?(ЗначениеЗаполнено(СвязанныйДокумент), ИдентификаторСсылки(СвязанныйДокумент),"");
		Связь.LinkedString = СтрокаСвязи.СвязаннаяСтрока;
		Связь.Direction = "Прямая";
		Связь.Comment = СтрокаСвязи.Комментарий;
		КонтейнерДокументаXDTO.Links.Добавить(Связь);
		// Обратная.
		Если Не ЗначениеЗаполнено(СтрокаСвязи.ТипОбратнойСвязиИдентификатор)
				Или Не ЗначениеЗаполнено(СтрокаСвязи.СвязанныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаСвязи.ТипОбратнойСвязиНаименование) Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС
				+ СтрШаблон(НСтр("ru = 'Не заполнено наименование типа обратной связи ""%1""'"),
					СтрокаСвязи.ТипОбратнойСвязиИдентификатор);
			Продолжить;
		КонецЕсли;
		Связь = ФабрикаXDTO.Создать(ТипXDTOСвязи);
		Если СвойстваСвязиXDTO.Получить("TypeID") <> Неопределено Тогда
			Связь.TypeID = СтрокаСвязи.ТипОбратнойСвязиИдентификатор;
		КонецЕсли;
		Связь.TypeName = СтрокаСвязи.ТипОбратнойСвязиНаименование;
		Связь.LinkedDocumentID = ?(ЗначениеЗаполнено(СвязанныйДокумент), ИдентификаторСсылки(СвязанныйДокумент),"");
		Связь.LinkedString = "";
		Связь.Direction = "Обратная";
		Связь.Comment = СтрокаСвязи.Комментарий;
		КонтейнерДокументаXDTO.Links.Добавить(Связь);
	КонецЦикла;
	
	// Штрихкоды.
	Если СвойстваКонтейнераXDTO.Получить("Barcodes") <> Неопределено Тогда
		ВыборкаШтрихкоды = ВыборкаДокумент.Штрихкоды.Выбрать();
		ТипXDTOШтрихкоды = СвойстваКонтейнераXDTO.Получить("Barcodes").Тип;
		Пока ВыборкаШтрихкоды.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаШтрихкоды.Код) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаШтрихкодов = ФабрикаXDTO.Создать(ТипXDTOШтрихкоды);
			СтрокаШтрихкодов.IsMain = ВыборкаШтрихкоды.Основной;
			СтрокаШтрихкодов.Code = ВыборкаШтрихкоды.Код;
			КонтейнерДокументаXDTO.Barcodes.Добавить(СтрокаШтрихкодов);
		КонецЦикла;
	КонецЕсли;
	
	// Файлы, электронные подписи.
	ПодпапкаФайловКонтейнера = ВременнаяПапка + "ctnr" + ПолучитьРазделительПути();
	СоздатьКаталог(ПодпапкаФайловКонтейнера);
	
	ТабФайлов = ВыборкаДокумент.Файлы.Выгрузить();
	ТабПодписей = ВыборкаДокумент.ПодписиДокумента.Выгрузить();
	ТабСтатусовЭДО = ВыборкаДокумент.СтатусыФайловЭДО.Выгрузить();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		Запрос = ЗапросПоЭлектроннымПодписям();
		Запрос.УстановитьПараметр("ФайлыДокумента", ТабФайлов.ВыгрузитьКолонку("Файл"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПодписьВерна <> Истина Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС
					+ СтрШаблон(НСтр("ru = 'Подпись неверна: файл ""%1"", подписал ""%2"".'"),
						Выборка.Файл, Выборка.Подписал);
				Продолжить;
			КонецЕсли;
			СтрокаПодписи = ТабПодписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПодписи, Выборка);
			Если ЗначениеЗаполнено(Выборка.Сертификат) Тогда
				ЗаполнитьСведенияОПодписантеИзСертификата(Выборка.Сертификат, СтрокаПодписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТипXDTOФайл = СвойстваКонтейнераXDTO.Получить("Files").Тип;
	Для Каждого СтрокаФайла Из ТабФайлов Цикл
		
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(СтрокаФайла.Файл);
		ИмяФайлаДокумента = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(
			ДанныеФайла.ПолноеНаименованиеВерсии, ДанныеФайла.Расширение);
		ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(СтрокаФайла.Файл);
		ПолноеИмяФайлаДокументаОригинальное = ПодпапкаФайловКонтейнера + ИмяФайлаДокумента;
		ПолноеИмяФайлаДокумента = ФайловаяСистема.УникальноеИмяФайла(ПолноеИмяФайлаДокументаОригинальное);
		Если ПолноеИмяФайлаДокументаОригинальное <> ПолноеИмяФайлаДокумента Тогда
			Файл = Новый Файл(ПолноеИмяФайлаДокумента);
			ИмяФайлаДокумента = Файл.Имя;
		КонецЕсли;
		Попытка
			ДвоичныеДанныеФайла.Записать(ПолноеИмяФайлаДокумента);
		Исключение
			ТекстОшибки = ТекстОшибки + Символы.ПС
				+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Продолжить;
		КонецПопытки;
		
		ИмяФайлаВизуализации = "";
		ПолноеИмяФайлаВизуализации = "";
		ДвоичныеДанныеФайлаВизуализации = Неопределено;
		Если ЗначениеЗаполнено(СтрокаФайла.ФайлВизуализации) Тогда
			ДанныеФайлаВизуализации = РаботаСФайлами.ДанныеФайла(СтрокаФайла.ФайлВизуализации);
			ИмяФайлаВизуализации = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(
				ДанныеФайлаВизуализации.ПолноеНаименованиеВерсии, ДанныеФайлаВизуализации.Расширение);
			ДвоичныеДанныеФайлаВизуализации = РаботаСФайлами.ДвоичныеДанныеФайла(СтрокаФайла.ФайлВизуализации);
		КонецЕсли;
		Если ТипЗнч(ДвоичныеДанныеФайлаВизуализации) = Тип("ДвоичныеДанные") Тогда
			Поток = ДвоичныеДанныеФайлаВизуализации.ОткрытьПотокДляЧтения();
			ПроверяемыйДокумент = Новый ДокументPDF;
			ПроверяемыйДокумент.Прочитать(Поток);
			ТипФайлаPDF = ПроверяемыйДокумент.ТипФайла;
			Если ТипФайлаPDF <> ТипФайлаДокументаPDF.PDF
					И ТипФайлаPDF <> ТипФайлаДокументаPDF.PDF_A_1
					И ТипФайлаPDF <> ТипФайлаДокументаPDF.PDF_A_2
					И ТипФайлаPDF <> ТипФайлаДокументаPDF.PDF_A_3 Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС
					+ СтрШаблон(НСтр("ru = 'Сформированный файл визуализации для ""%1"" не является файлом PDF/A.'"),
						ИмяФайлаДокумента);
				Продолжить;
			КонецЕсли;
			ИмяФайлаВизуализации = ?(ЗначениеЗаполнено(ИмяФайлаВизуализации),
				ИмяФайлаВизуализации, ИмяФайлаДокумента + ".pdf");
			ПолноеИмяФайлаВизуализацииОригинальное = ПодпапкаФайловКонтейнера + ИмяФайлаВизуализации;
			ПолноеИмяФайлаВизуализации = ФайловаяСистема.УникальноеИмяФайла(ПолноеИмяФайлаВизуализацииОригинальное);
			Если ПолноеИмяФайлаВизуализацииОригинальное <> ПолноеИмяФайлаВизуализации Тогда
				Файл = Новый Файл(ПолноеИмяФайлаВизуализации);
				ИмяФайлаВизуализации = Файл.Имя;
			КонецЕсли;
			Попытка
				ДвоичныеДанныеФайлаВизуализации.Записать(ПолноеИмяФайлаВизуализации);
			Исключение
				ТекстОшибки = ТекстОшибки + Символы.ПС
					+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		ЗаписьZipФайлаКонтейнер.Добавить(ПолноеИмяФайлаДокумента);
		Если ЗначениеЗаполнено(ПолноеИмяФайлаВизуализации) Тогда
			ЗаписьZipФайлаКонтейнер.Добавить(ПолноеИмяФайлаВизуализации);
		КонецЕсли;
		
		ЭлементXDTOФайлы = ФабрикаXDTO.Создать(ТипXDTOФайл);
		ЭлементXDTOФайлы.FileName = ИмяФайлаДокумента;
		ЭлементXDTOФайлы.VisualizationFileName = ИмяФайлаВизуализации;
		
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешированиеДанных.ДобавитьФайл(ПолноеИмяФайлаДокумента);
		ЭлементXDTOФайлы.HashSum = Base64Строка(ХешированиеДанных.ХешСумма);
		
		ЭлементXDTOФайлы.Size = ДанныеФайла.Размер;
		ЭлементXDTOФайлы.Modified = ДанныеФайла.ДатаМодификацииУниверсальная;
		
		Если ЗначениеЗаполнено(СтрокаФайла.ТипРегламентаЭДО) Тогда
			ЭлементXDTOФайлы.EDIFileType = СтрокаФайла.ТипРегламентаЭДО;
		КонецЕсли;
		
		// Роль.
		Если ЗначениеЗаполнено(СтрокаФайла.Роль) Тогда
			ЭлементXDTOФайлы.RoleID = ИдентификаторСсылки(СтрокаФайла.Роль);
			ЭлементXDTOФайлы.RoleName = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				СтрокаФайла.Роль, "Наименование");
		КонецЕсли;
		
		// Подписи.
		ПодписиФайла = ТабПодписей.НайтиСтроки(Новый Структура("Файл", СтрокаФайла.Файл));
		Для ИндексСтроки = 0 По ПодписиФайла.Количество() - 1 Цикл
			СтрокаПодписи = ПодписиФайла[ИндексСтроки];
			ИмяФайлаПодписи = "";
			ЭлементXDTOПодписи = ФабрикаXDTO.Создать(ЭлементXDTOФайлы.Свойства().Получить("Signatures").Тип);
			СвойстваПодписиXDTO = ЭлементXDTOПодписи.Свойства();
			Если СтрокаПодписи.ВидПодписи = Перечисления.ВидыПодписейДокументовБИА.Усиленная Тогда
				ЭлементXDTOПодписи.Type = "Qualified";
			ИначеЕсли СтрокаПодписи.ВидПодписи = Перечисления.ВидыПодписейДокументовБИА.Простая Тогда
				ЭлементXDTOПодписи.Type = "Simple";
			ИначеЕсли СтрокаПодписи.ВидПодписи = Перечисления.ВидыПодписейДокументовБИА.НаБумаге Тогда
				ЭлементXDTOПодписи.Type = "Paper";
			Иначе
				ТекстОшибки = ТекстОшибки + Символы.ПС
					+ СтрШаблон(НСтр("ru = 'Не определен вид подписи файла %1 от %2 (подписал ""%3""'"),
						СтрокаФайла.Файл, СтрокаПодписи.ДатаПодписи, СтрокаПодписи.Подписал);
				Продолжить;
			КонецЕсли;
			Если СвойстваПодписиXDTO.Получить("SignerTitle") <> Неопределено Тогда
				ЭлементXDTOПодписи.Signer = СтрокаПодписи.Подписал;
				ЭлементXDTOПодписи.SignerTitle = СтрокаПодписи.Должность;
			Иначе
				ПредставлениеПодписанта = ?(ЗначениеЗаполнено(СтрокаПодписи.Должность),
					СтрокаПодписи.Подписал + ", " + СтрокаПодписи.Должность, СтрокаПодписи.Подписал);
				ЭлементXDTOПодписи.Signer = ПредставлениеПодписанта;
			КонецЕсли;
			ЭлементXDTOПодписи.Date = СтрокаПодписи.ДатаПодписи;
			ЭлементXDTOПодписи.WarrantNumber = СокрЛП(СтрокаПодписи.НомерДоверенности);
			Если СвойстваПодписиXDTO.Получить("IsValid") <> Неопределено Тогда
				ЭлементXDTOПодписи.IsValid = Истина;
			КонецЕсли;
			Если СтрокаПодписи.ВидПодписи <> Перечисления.ВидыПодписейДокументовБИА.НаБумаге Тогда
				ДвоичныеДанныеПодписи = СтрокаПодписи.Подпись.Получить();
				Если Не ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
					ТекстОшибки = ТекстОшибки + Символы.ПС
						+ СтрШаблон(НСтр("ru = 'Не заполнены данные подписи файла %1 от %2 (подписал ""%3""'"),
							СтрокаФайла.Файл, СтрокаПодписи.ДатаПодписи, СтрокаПодписи.Подписал);
					Продолжить;
				КонецЕсли;
				ИмяФайлаПодписи = СтрШаблон("%1%2SGN.sgn", ИмяФайлаДокумента,
					?(ИндексСтроки = 0, "", "_" + Строка(ИндексСтроки)));
				ИмяФайлаПодписиПолное = ПодпапкаФайловКонтейнера + ИмяФайлаПодписи;
				Попытка
					ДвоичныеДанныеПодписи.Записать(ИмяФайлаПодписиПолное);
					ЗаписьZipФайлаКонтейнер.Добавить(ИмяФайлаПодписиПолное);
					Если СтрокаПодписи.ВидПодписи = Перечисления.ВидыПодписейДокументовБИА.Простая
							И СвойстваПодписиXDTO.Получить("SESHashSum") <> Неопределено Тогда
						ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
						ХешированиеДанных.ДобавитьФайл(ИмяФайлаПодписиПолное);
						ЭлементXDTOПодписи.SESHashSum = Base64Строка(ХешированиеДанных.ХешСумма);
					КонецЕсли;
				Исключение
					ТекстОшибки = ТекстОшибки + Символы.ПС
						+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Продолжить;
				КонецПопытки;
			КонецЕсли;
			ЭлементXDTOПодписи.FileName = Строка(ИмяФайлаПодписи);
			ЭлементXDTOФайлы.Signatures.Добавить(ЭлементXDTOПодписи);
		КонецЦикла;
		
		// Статусы ЭДО.
		НайденныеСтрокиСтатусов = ТабСтатусовЭДО.НайтиСтроки(Новый Структура("Файл", СтрокаФайла.Файл));
		ЭлементXDTOЖурналЭДО = ФабрикаXDTO.Создать(ЭлементXDTOФайлы.Свойства().Получить("EDIStatuses").Тип);
		Для Каждого СтрокаСтатусаЭДО Из НайденныеСтрокиСтатусов Цикл
			ЭлементXDTOЖурналЭДО.Date = СтрокаСтатусаЭДО.Дата;
			ЭлементXDTOЖурналЭДО.Value = СтрокаСтатусаЭДО.Статус;
			ЭлементXDTOФайлы.EDIStatuses.Добавить(ЭлементXDTOЖурналЭДО);
		КонецЦикла;
		
		КонтейнерДокументаXDTO.Files.Добавить(ЭлементXDTOФайлы);
		
	КонецЦикла;
	
	// Свойства документа ЭДО.
	Если ЗначениеЗаполнено(ВыборкаДокумент.ЭДОНаправление) Тогда
		ТипXDTOСвойстваЭДО = СвойстваКонтейнераXDTO.Получить("EDIProperties").Тип;
		СтрокаСвойстваЭДО = ФабрикаXDTO.Создать(ТипXDTOСвойстваЭДО);
		СтрокаСвойстваЭДО.Direction = ВыборкаДокумент.ЭДОНаправление;
		СтрокаСвойстваЭДО.Number = ВыборкаДокумент.ЭДОНомер;
		СтрокаСвойстваЭДО.Date = ВыборкаДокумент.ЭДОДата;
		КонтейнерДокументаXDTO.EDIProperties.Добавить(СтрокаСвойстваЭДО);
	КонецЕсли;
		
	ОшибкиЗаполнения = ПроверитьЗаполнениеСвойствXDTO(КонтейнерДокументаXDTO);
	Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОшибкиЗаполнения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;
		
	// Запись контейнера документа.
	ИмяФайлаОписанияКонтейнера = ПодпапкаФайловКонтейнера + "Document.xml";
	ПотокЗаписи = Новый ЗаписьXML();
	ПотокЗаписи.ОткрытьФайл(ИмяФайлаОписанияКонтейнера);
	ПотокЗаписи.ЗаписатьОбъявлениеXML();
	
	Попытка
		ФабрикаXDTO.ЗаписатьXML(ПотокЗаписи, КонтейнерДокументаXDTO,,,, НазначениеТипаXML.Явное);
		ПотокЗаписи.Закрыть();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	ЗаписьZipФайлаКонтейнер.Добавить(ИмяФайлаОписанияКонтейнера);
	Попытка
		ЗаписьZipФайлаКонтейнер.Записать();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	УдалитьФайлы(ПодпапкаФайловКонтейнера);
	
	ЗаписьZipФайлаПакетДокументов.Добавить(ИмяZipФайлаКонтейнераПолное);
	ЭлементXDTOСтрокаКонтейнера = ФабрикаXDTO.Создать(
		ПакетДокументовXDTO.Свойства().Получить("Documents").Тип);
	ЭлементXDTOСтрокаКонтейнера.ID = КонтейнерДокументаXDTO.ID;
	ЭлементXDTOСтрокаКонтейнера.ContainerFileName = ИмяZipФайлаКонтейнера + ".zip";
	ПакетДокументовXDTO.Documents.Добавить(ЭлементXDTOСтрокаКонтейнера);
	
#Иначе
	ВызватьИсключение НСтр(
		"ru = 'Метод ""ОбменСАрхивом.ДобавитьДокументВПакет"" недоступен во внешнем соединении.'");
#КонецЕсли
	
КонецПроцедуры

Процедура ОтправитьМЧД(ПараметрыТранспорта)
	
	УзелАрхив = ПланыОбмена.ОбменНСИСАрхивом.УзелАрхив();
	МетаданныеМЧД = МетаданныеМЧД();
	ОбъектыСОшибками = Новый Массив;
	
	ОбъектыДляВыгрузки = ПорцияИзмененныхДанныхДляВыгрузки(МетаданныеМЧД);
	Пока ОбъектыДляВыгрузки.Количество() > 0 Цикл
		
		Для Каждого МЧДСсылка Из ОбъектыДляВыгрузки Цикл
			
			НачатьТранзакцию();
			Попытка
				ВыгрузитьДоверенность(МЧДСсылка, ПараметрыТранспорта);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелАрхив, МЧДСсылка);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ОбъектыСОшибками.Добавить(МЧДСсылка);
				ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрацииВыгрузкаМЧД(),
					УровеньЖурналаРегистрации.Ошибка, НСтр("ru = 'Ошибка выгрузки МЧД'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), МЧДСсылка);
			КонецПопытки;
			
		КонецЦикла;
		
		ОбъектыДляВыгрузки = ПорцияИзмененныхДанныхДляВыгрузки(МетаданныеМЧД, ОбъектыСОшибками);
		
	КонецЦикла;
	
КонецПроцедуры

Функция МетаданныеМЧД()
	
	МетаданныеМЧД = Новый Массив;
	Для Каждого ТипМЧД Из Метаданные.ОпределяемыеТипы.МашиночитаемаяДоверенностьБИА.Тип.Типы() Цикл
		МетаданныеМЧД.Добавить(Метаданные.НайтиПоТипу(ТипМЧД));
	КонецЦикла;
	
	Возврат МетаданныеМЧД;
	
КонецФункции

Функция ПорцияНСИДляВыгрузки(ОбъектыСОшибками = Неопределено)
	
	МетаданныеНСИ = Новый Массив;
	МетаданныеМЧД = МетаданныеМЧД();
	Для Каждого ЭлементСостава Из Метаданные.ПланыОбмена.ОбменНСИСАрхивом.Состав Цикл
		// Все типы из плана обмена, кроме МЧД.
		Если МетаданныеМЧД.Найти(ЭлементСостава.Метаданные) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МетаданныеНСИ.Добавить(ЭлементСостава.Метаданные);
	КонецЦикла;
	
	Возврат ПорцияИзмененныхДанныхДляВыгрузки(МетаданныеНСИ, ОбъектыСОшибками);
	
КонецФункции

Функция ПорцияИзмененныхДанныхДляВыгрузки(ОбъектыМетаданных, ОбъектыСОшибками = Неопределено)

	
	ШаблонТекстаЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ТаблицаИзменений.Ссылка КАК Ссылка
		|ИЗ
		|	#ТаблицаИзменений КАК ТаблицаИзменений
		|ГДЕ
		|	ТаблицаИзменений.Узел = &УзелАрхив
		|	И НЕ ТаблицаИзменений.Ссылка В (&ОбъектыСОшибками)";
	
	Для Каждого ОбъектМетаданных Из ОбъектыМетаданных Цикл
		ИмяТаблицыИзменений = СтрШаблон("%1.Изменения", ОбъектМетаданных.ПолноеИмя());
		Запрос = Новый Запрос(СтрЗаменить(ШаблонТекстаЗапроса, "#ТаблицаИзменений", ИмяТаблицыИзменений));
		Запрос.УстановитьПараметр("УзелАрхив", ПланыОбмена.ОбменНСИСАрхивом.УзелАрхив());
		Запрос.УстановитьПараметр("ОбъектыСОшибками", ОбъектыСОшибками);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Возврат Результат.Выгрузить().ВыгрузитьКолонку(0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции

Функция МаксКоличествоДокументовВПакете()
	
	Лимит = Константы.МаксимальноеКоличествоДокументовВПакетеДля1САрхива.Получить();
	Если Лимит = 0 Тогда
		Лимит = 100;
	КонецЕсли;
	
	Возврат Лимит;
	
КонецФункции

// Выгружает МЧД в каталог для отправки в 1С:Архив.
// 
// Параметры:
//  МЧДСсылка - СправочникСсылка - ссылка на МЧД.
//  ПараметрыТранспорта - Структура: см. ОбменСАрхивомТранспорт.ПараметрыТранспортаДляСеансаОбмена.
//
Процедура ВыгрузитьДоверенность(МЧДСсылка, ПараметрыТранспорта)
	
	ВременнаяПапка = ПолучитьИмяВременногоФайла("") + ПолучитьРазделительПути();
	СоздатьКаталог(ВременнаяПапка);
	
	ДанныеМЧД = ДанныеМЧДДляВыгрузки(МЧДСсылка, ВременнаяПапка);
	Если ДанныеМЧД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбязательныеДанные = Новый Массив;
	ОбязательныеДанные.Добавить("Тип");
	ОбязательныеДанные.Добавить("НомерДоверенности");
	НезаполненныеОбязательныеДанные = Новый Массив;
	Если ДанныеМЧД.ЕстьВРеестреФНС Тогда
		ОбязательныеДанные.Добавить("ИННДоверителя");
	Иначе
		ОбязательныеДанные.Добавить("ИмяФайлаМЧД");
		ОбязательныеДанные.Добавить("ИмяФайлаПодписиМЧД");
	КонецЕсли;
	Для Каждого ИмяОбязательногоСвойства Из ОбязательныеДанные Цикл
		Если Не ЗначениеЗаполнено(ДанныеМЧД[ИмяОбязательногоСвойства]) Тогда
			НезаполненныеОбязательныеДанные.Добавить(ИмяОбязательногоСвойства);
		КонецЕсли;
	КонецЦикла;
	Если НезаполненныеОбязательныеДанные.Количество() > 0 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнены обязательные данные доверенности: %1'"),
			СтрСоединить(НезаполненныеОбязательныеДанные, ","));
	КонецЕсли;
	
	ИмяФайлаОписанияМЧД = ВременнаяПапка + "Warrant.xml";
	ИмяZipФайлаВыгрузки = ВременнаяПапка + ТекущаяОтметкаВремени() + ".zip";
	ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяZipФайлаВыгрузки);

	ПространствоИменСхемы = ВерсияФорматаДляОтправкиСообщений();
	ЭлементXDTOМЧД = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменСхемы, "Warrant"));
	СвойстваМЧДXDTO = ЭлементXDTOМЧД.Свойства();
	ЭлементXDTOМЧД.Type = ДанныеМЧД.Тип;
	ЭлементXDTOМЧД.Number = ДанныеМЧД.НомерДоверенности;
	ЭлементXDTOМЧД.IsInRegister = ДанныеМЧД.ЕстьВРеестреФНС;
	ЭлементXDTOМЧД.EntrusterTIN = ДанныеМЧД.ИННДоверителя;
	Если СвойстваМЧДXDTO.Получить("Comment") <> Неопределено Тогда
		ЭлементXDTOМЧД.Comment = ДанныеМЧД.Комментарий;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеМЧД.ИмяФайлаМЧД) Тогда
		ЗаписьZipФайла.Добавить(ВременнаяПапка + ДанныеМЧД.ИмяФайлаМЧД);
		ЭлементXDTOМЧД.WarrantFileName = ДанныеМЧД.ИмяФайлаМЧД;
	ИначеЕсли ДанныеМЧД.ЕстьВРеестреФНС <> Истина Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен файл доверенности'");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеМЧД.ИмяФайлаПодписиМЧД) Тогда
		ЗаписьZipФайла.Добавить(ВременнаяПапка + ДанныеМЧД.ИмяФайлаПодписиМЧД);
		ЭлементXDTOМЧД.SignatureFileName = ДанныеМЧД.ИмяФайлаПодписиМЧД;
	ИначеЕсли ДанныеМЧД.ЕстьВРеестреФНС <> Истина Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен файл подписи доверенности'");
	КонецЕсли;
	
	ПотокЗаписи = Новый ЗаписьXML();
	ПотокЗаписи.ОткрытьФайл(ИмяФайлаОписанияМЧД);
	ПотокЗаписи.ЗаписатьОбъявлениеXML();
	Попытка
		ФабрикаXDTO.ЗаписатьXML(ПотокЗаписи, ЭлементXDTOМЧД,,,, НазначениеТипаXML.Явное);
		ПотокЗаписи.Закрыть();
		ЗаписьZipФайла.Добавить(ИмяФайлаОписанияМЧД);
	Исключение
		УдалитьВременныеФайлы(ВременнаяПапка);
		ВызватьИсключение;
	КонецПопытки;
	
	Попытка
		ЗаписьZipФайла.Записать();
		ФайлВыгрузки = Новый Файл(ИмяZipФайлаВыгрузки);
		ИмяZipФайлаВыгрузкиФинальное = ТекущаяОтметкаВремени() + ".zip";
		ПереместитьФайл(ФайлВыгрузки.ПолноеИмя, ФайлВыгрузки.Путь + ИмяZipФайлаВыгрузкиФинальное);
		ОбменСАрхивомТранспорт.ОтправитьФайл(ФайлВыгрузки.Путь + ИмяZipФайлаВыгрузкиФинальное, ПараметрыТранспорта);
		УдалитьВременныеФайлы(ВременнаяПапка);
		ЛогированиеОперацийОбменаСАрхивом(
			СобытиеЖурналаРегистрацииВыгрузкаМЧД(),
			УровеньЖурналаРегистрации.Информация,
			НСтр("ru = 'Выгрузка МЧД завершена.'"),,
			МЧДСсылка);
	Исключение
		УдалитьВременныеФайлы(ВременнаяПапка);
		ВызватьИсключение;
	КонецПопытки;
	
	УдалитьВременныеФайлы(ВременнаяПапка)
	
КонецПроцедуры

// Возвращает данные указанной МЧД, необходимые для выгрузки в 1С:Архив.
//
// Параметры:
//  МЧДСсылка - СправочникСсылка - ссылка на МЧД.
//  ВременнаяПапка - Строка - временная папка, которую можно использовать для формирования файлов.
//    После выгрузки МЧД папка будет удалена автоматически.
//
// Возвращаемое значение:
//  Структура, Неопределено - свойства доверенности, см. ОбменСАрхивом.НовоеОписаниеМЧД.
//    Неопределено, если выгрузка этого элемента не требуется.
// 
Функция ДанныеМЧДДляВыгрузки(МЧДСсылка, ВременнаяПапка)
	
	ОписаниеМЧД = Неопределено;
	Если Не ЗначениеЗаполнено(МЧДСсылка) Тогда
		Возврат ОписаниеМЧД;
	КонецЕсли;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.МашиночитаемыеДоверенности")
			И ТипЗнч(МЧДСсылка) = Тип("СправочникСсылка.МашиночитаемыеДоверенности") Тогда
		
		РеквизитыМЧД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МЧДСсылка,
			"ПометкаУдаления, Верна, Статус, НомерДоверенности, Доверители, РегистрироватьВРеестре");
		СтатусыМЧДМенеджер = Перечисления.СтатусыМЧД;
		Если РеквизитыМЧД.ПометкаУдаления <> Ложь
				Или РеквизитыМЧД.Верна <> Истина
				Или РеквизитыМЧД.Статус = СтатусыМЧДМенеджер.ПустаяСсылка()
				Или РеквизитыМЧД.Статус = СтатусыМЧДМенеджер.Черновик Тогда
			Возврат ОписаниеМЧД;
		КонецЕсли;
		
		ОписаниеМЧД = НовоеОписаниеМЧД();
		ОписаниеМЧД.Тип = "EMCHD";
		ОписаниеМЧД.НомерДоверенности = РеквизитыМЧД.НомерДоверенности;
		ОписаниеМЧД.ЕстьВРеестреФНС = РеквизитыМЧД.РегистрироватьВРеестре
			И РеквизитыМЧД.Статус = СтатусыМЧДМенеджер.Действует;
		
		ВыборкаДоверители = РеквизитыМЧД.Доверители.Выбрать();
		Если ВыборкаДоверители.Следующий() Тогда
			РеквизитыДоверителя = ВыборкаДоверители.ДоверительРеквизиты.Получить();
			Если ТипЗнч(РеквизитыДоверителя) = Тип("Структура") Тогда
				Если РеквизитыДоверителя.Свойство("ИНН") Тогда
					ОписаниеМЧД.ИННДоверителя = РеквизитыДоверителя.ИНН;
				ИначеЕсли РеквизитыДоверителя.Свойство("ИННФЛ") Тогда
					ОписаниеМЧД.ИННДоверителя = РеквизитыДоверителя.ИННФЛ;
				КонецЕсли;
			Иначе
				ВызватьИсключение НСтр("ru = 'Не удалось получить реквизиты доверителя'");
			КонецЕсли;
		Иначе
			ВызватьИсключение НСтр("ru = 'Не удалось определить доверителя'");
		КонецЕсли;
		
		МодульМашиночитаемыеДоверенностиФНС = ОбщегоНазначения.ОбщийМодуль("МашиночитаемыеДоверенностиФНС");
		ФайлыДоверенностей = МодульМашиночитаемыеДоверенностиФНС.ФайлыДоверенностей(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МЧДСсылка), Ложь);
		ФайлыДоверенности = ФайлыДоверенностей[МЧДСсылка];
		Если ФайлыДоверенности <> Неопределено Тогда
			Для Каждого СтрокаФайла Из ФайлыДоверенности Цикл
				СтрокаФайла.ДвоичныеДанные.Записать(ВременнаяПапка + СтрокаФайла.ИмяФайла);
				Если СтрокаФайла.ТипФайла = "Доверенность" Тогда
					ОписаниеМЧД.ИмяФайлаМЧД = СтрокаФайла.ИмяФайла;
				ИначеЕсли СтрокаФайла.ТипФайла = "Подпись" Тогда
					ОписаниеМЧД.ИмяФайлаПодписиМЧД = СтрокаФайла.ИмяФайла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		ОписаниеМЧД = ОбменСАрхивомПереопределяемый.ДанныеМЧДДляВыгрузки(МЧДСсылка, ВременнаяПапка);
		
	КонецЕсли;
	
	Возврат ОписаниеМЧД;
	
КонецФункции

Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Обмен с 1С:Архивом'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция СобытиеЖурналаРегистрацииОтправкаСообщений()
	
	Возврат СобытиеЖурналаРегистрации() + "." + НСтр("ru = 'Отправка сообщений'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция СобытиеЖурналаРегистрацииВыгрузкаМЧД()
	
	Возврат СобытиеЖурналаРегистрации() + "." + НСтр("ru = 'Выгрузка МЧД'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция СобытиеЖурналаРегистрацииВыгрузкаНСИ()
	
	Возврат СобытиеЖурналаРегистрации() + "." + НСтр("ru = 'Выгрузка НСИ'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция СобытиеЖурналаРегистрацииОбработкаОтчетов()
	
	Возврат СобытиеЖурналаРегистрации() + "." + НСтр("ru = 'Обработка отчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция СобытиеЖурналаРегистрацииУничтожениеДел()
	
	Возврат СобытиеЖурналаРегистрации() + "." + НСтр("ru = 'Загрузка документа Уничтожение дел'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Процедура ЛогированиеОперацийОбменаСАрхивом(СобытиеЖР, УровеньЖР, ТекстСообщения,
			Знач ПолныйТекстСообщения = "", ОбъектСсылка = Неопределено, СобытиеИстории = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолныйТекстСообщения) Тогда
		ПолныйТекстСообщения = ТекстСообщения;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖР,, ОбъектСсылка, ПолныйТекстСообщения);
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СобытиеИстории) Тогда
		Если УровеньЖР = УровеньЖурналаРегистрации.Ошибка Тогда
			СобытиеИстории = Перечисления.СобытияОбменаС1САрхивом.ОшибкаОбмена;
		Иначе
			СобытиеИстории = Перечисления.СобытияОбменаС1САрхивом.Прочее;
		КонецЕсли;
	КонецЕсли;
	
	РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(ОбъектСсылка,
		СобытиеИстории, ТекстСообщения,,,, ПолныйТекстСообщения);
	
КонецПроцедуры

// Присваивает пакету статус "Обнаружены ошибки при выгрузкие".
// 
// Параметры:
//  ПакетСсылка - СправочникСсылка.ПакетыДокументовДля1САрхива - пакет документов
//  ТекстОшибки - Строка - текст ошибки
// 
Процедура УстановитьСтатусОшибкиВыгрузкиПакета(ПакетСсылка, ТекстОшибки)
	
	ТекущийСтатусПакета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПакетСсылка, "СтатусОбменаСАрхивом");
	
	Если ТекущийСтатусПакета = Перечисления.СтатусыОбменаС1САрхивом.ГотовКВыгрузке Тогда
		
		ПакетОбъект = ПакетСсылка.ПолучитьОбъект();
		ПакетОбъект.Заблокировать();
		ПакетОбъект.СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ОбнаруженыОшибкиПриВыгрузке;
		ПакетОбъект.РезультатПроверки = ТекстОшибки;
		ПакетОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДанные(ПараметрыТранспорта)
	
	ТаблицаФайлов = ОбменСАрхивомТранспорт.ФайлыДляЗагрузки(ПараметрыТранспорта);
	Пока ТаблицаФайлов.Количество() > 0 Цикл
		
		Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		
			ВходящийФайл = СтрокаФайла.Файл;
			
			Попытка
				
				Если НРег(ВходящийФайл.Расширение) = ".zip" Тогда
					
					КаталогИзвлеченныхФайлов = ИзвлечьФайлыИзАрхива(ВходящийФайл.ПолноеИмя);
					ФайлыОписанияОтчета = НайтиФайлы(КаталогИзвлеченныхФайлов, "Report.xml", Истина);
					ФайлыОписанияДокументаУничтожениеДел = НайтиФайлы(КаталогИзвлеченныхФайлов, "DossiersDestruction.xml", Истина);
					Если ФайлыОписанияОтчета.Количество() Тогда
						ЗагрузитьОтчет(ФайлыОписанияОтчета[0], КаталогИзвлеченныхФайлов);
					ИначеЕсли ФайлыОписанияДокументаУничтожениеДел.Количество() Тогда
						ЗагрузитьУничтожениеДел(ФайлыОписанияДокументаУничтожениеДел[0], КаталогИзвлеченныхФайлов);
					КонецЕсли;
					УдалитьФайлы(КаталогИзвлеченныхФайлов);
					
				ИначеЕсли НРег(ВходящийФайл.Расширение) = ".json" Тогда
					
					СообщениеXDTO = ПрочитатьОбъектXDTOИзФайла(ВходящийФайл.ПолноеИмя);
					СвойстваXDTO = СообщениеXDTO.Свойства();
					Если СвойстваXDTO.Количество() = 1
							И СвойстваXDTO.Получить(ИмяСвойстваВерсияФормата()) <> Неопределено Тогда
						// Версия формата.
						НоваяВерсия = СообщениеXDTO.FormatVersion;
						СтараяВерсия = Константы.ВерсияФорматаОбменаПоддерживаемая1САрхивом.Получить();
						Если НоваяВерсия <> СтараяВерсия Тогда
							Константы.ВерсияФорматаОбменаПоддерживаемая1САрхивом.Установить(НоваяВерсия);
							ЛогированиеОперацийОбменаСАрхивом(
								СобытиеЖурналаРегистрации(),
								УровеньЖурналаРегистрации.Информация,
								СтрШаблон(НСтр("ru = 'Загрузка информации о версии формата (%1)'"), НоваяВерсия),,
								Пользователи.ТекущийПользователь());
							// Ответное сообщение о версии формата.
							СформироватьСообщениеОВерсииФормата();
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				ОбменСАрхивомТранспорт.ПереместитьЗагруженныйФайл(СтрокаФайла, Ложь, ПараметрыТранспорта);
				
			Исключение
				
				Если НРег(ВходящийФайл.Расширение) = ".zip" Тогда
					УдалитьФайлы(КаталогИзвлеченныхФайлов);
				КонецЕсли;
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка при обработке файла %1: %2'"),
					ВходящийФайл.ПолноеИмя, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЛогированиеОперацийОбменаСАрхивом(СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,, ТекстСообщения);
				
				ОбменСАрхивомТранспорт.ПереместитьЗагруженныйФайл(СтрокаФайла, Истина, ПараметрыТранспорта);
				
			КонецПопытки;
			
		КонецЦикла;
		
		ТаблицаФайлов = ОбменСАрхивомТранспорт.ФайлыДляЗагрузки(ПараметрыТранспорта);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьОтчет(ФайлОписанияОтчета, КаталогИзвлеченныхФайлов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтчетXDTO = ПрочитатьОбъектXDTOИзФайла(ФайлОписанияОтчета.ПолноеИмя);
	ИмяФайлаОписанияОбъекта = ОтчетXDTO.ObjectFileName;
	НайденныеФайлы = НайтиФайлы(КаталогИзвлеченныхФайлов, ИмяФайлаОписанияОбъекта, Ложь);
	Если НайденныеФайлы.Количество() = 0 Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'не найден файл описания выгруженного объекта %1'"),
			ИмяФайлаОписанияОбъекта);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ФайлОписанияОбъекта = НайденныеФайлы[0];
	
	// Обязательное свойство "ContainerFileName" в отчете из 1С:Архива не выгружается,
	// добавим его в исключения при проверке.
	НеобязательныеСвойства = Новый Массив;
	НеобязательныеСвойства.Добавить("ContainerFileName");
	ОбъектОтчетаXDTO = ПрочитатьОбъектXDTOИзФайла(ФайлОписанияОбъекта.ПолноеИмя, НеобязательныеСвойства);
	Если ОбъектОтчетаXDTO.Тип().Имя = "DocumentPackage" Тогда
		ЗагрузитьОтчетПоПакетуДокументов(ОтчетXDTO, ОбъектОтчетаXDTO);
	Иначе
		ТекстОшибки = СтрШаблон(НСтр("ru = 'неизвестный тип объекта: %1'"), ОбъектОтчетаXDTO.Тип());
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьОтчетПоПакетуДокументов(ОтчетXDTO, ОбъектОтчетаXDTO)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПакетСсылка = Неопределено;
	СвойстваОтчетаXDTO = ОтчетXDTO.Свойства();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПакетыДокументовДля1САрхива.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива КАК ПакетыДокументовДля1САрхива
		|ГДЕ
		|	ПакетыДокументовДля1САрхива.Идентификатор = &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор", ОбъектОтчетаXDTO.ID);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПакетСсылка = Выборка.Ссылка;
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не найден пакет документов ""%1"".'"), ОбъектОтчетаXDTO.ID);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ПакетыДокументовДля1САрхива");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ПакетСсылка);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка.Заблокировать();
		ПакетОбъект = ПакетСсылка.ПолучитьОбъект();
		ПакетОбъект.Заблокировать();
		
		// Заполнение нового статуса.
		Если ОтчетXDTO.Operation = "Upload" Тогда
			ПакетОбъект.СтатусОбменаСАрхивом = 
				?(ОтчетXDTO.Success = Истина, Перечисления.СтатусыОбменаС1САрхивом.ЗагрузкаВАрхивВыполнена,
					Перечисления.СтатусыОбменаС1САрхивом.ОбнаруженыОшибкиПриЗагрузкеВАрхив);
		ИначеЕсли ОтчетXDTO.Operation = "Verification" Тогда
			ПакетОбъект.СтатусОбменаСАрхивом = 
			?(ОтчетXDTO.Success = Истина, Перечисления.СтатусыОбменаС1САрхивом.ПринятВАрхив,
				Перечисления.СтатусыОбменаС1САрхивом.ОбнаруженыОшибкиПриПроверкеВАрхиве);
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Неожиданное значение в поле Operation: %1'"),
				ОтчетXDTO.Operation);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		// Проверка состава документов.
		Если ПакетОбъект.СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ПринятВАрхив Тогда
			
			ОшибкиПоискаДокументовМассив = Новый Массив;
			ДокументыВОтчете = Новый Массив;
			Для Каждого СтрокаДокумента Из ОбъектОтчетаXDTO.Documents Цикл
				ДокументСсылка = Справочники.ДокументыБИА.ПолучитьСсылку(
					Новый УникальныйИдентификатор(СтрокаДокумента.ID));
				ДокументыВОтчете.Добавить(ДокументСсылка);
				Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
					ОшибкиПоискаДокументовМассив.Добавить(СтрШаблон(
						НСтр("ru = 'Не найден документ %1, указанный в отчете'"), СтрокаДокумента.ID));
				КонецЕсли;
			КонецЦикла;
			Если ОшибкиПоискаДокументовМассив.Количество() > 0 Тогда
				ОшибкиПоискаДокументов = СтрСоединить(ОшибкиПоискаДокументовМассив, Символы.ПС);
				ВызватьИсключение ОшибкиПоискаДокументов;
			КонецЕсли;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ПакетыДокументовДля1САрхиваДокументы.Документ КАК Документ
				|ИЗ
				|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыДокументовДля1САрхиваДокументы
				|ГДЕ
				|	ПакетыДокументовДля1САрхиваДокументы.Ссылка = &Пакет");
			Запрос.УстановитьПараметр("Пакет", ПакетСсылка);
			ДокументыВПакете = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
			
			ОшибкиСверкиДокументовМассив = Новый Массив;
			ЛишниеДокументы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ДокументыВПакете, ДокументыВОтчете);
			Для Каждого ЛишнийДокумент Из ЛишниеДокументы Цикл
				ОшибкиСверкиДокументовМассив.Добавить(СтрШаблон(
					НСтр("ru = 'В пакете %1 указан документ %2, отсутствующий в отчете'"),
					ПолучитьНавигационнуюСсылку(ПакетСсылка), ПолучитьНавигационнуюСсылку(ЛишнийДокумент)));
			КонецЦикла;
			НедостающиеДокументы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ДокументыВОтчете, ДокументыВПакете);
			Для Каждого НедостающийДокумент Из НедостающиеДокументы Цикл
				ОшибкиСверкиДокументовМассив.Добавить(СтрШаблон(
					НСтр("ru = 'В пакете %1 отсутствует документ %2, указанный в отчете'"),
					ПолучитьНавигационнуюСсылку(ПакетСсылка),
					?(ОбщегоНазначения.СсылкаСуществует(НедостающийДокумент),
						ПолучитьНавигационнуюСсылку(НедостающийДокумент),
						НедостающийДокумент.УникальныйИдентификатор())));
			КонецЦикла;
			Если ОшибкиСверкиДокументовМассив.Количество() > 0 Тогда
				ОшибкиСверкиДокументов = СтрСоединить(ОшибкиСверкиДокументовМассив, Символы.ПС);
				ВызватьИсключение ОшибкиСверкиДокументов;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтчетXDTO.AccepterName) Тогда
			ПакетОбъект.Принял = ОтчетXDTO.AccepterName;
		КонецЕсли;
		
		Если СвойстваОтчетаXDTO.Получить("AcceptanceDate") <> Неопределено
				И ЗначениеЗаполнено(ОтчетXDTO.AcceptanceDate) Тогда
			ПакетОбъект.ДатаПриемки = ОтчетXDTO.AcceptanceDate;
		КонецЕсли;
		
		ПакетОбъект.РезультатПроверки = ОтчетXDTO.ResultText;
		ПакетОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуСтатусаПриЗаписи", Истина);
		ПакетОбъект.Записать();

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Загружен отчет. Изменен статус на ""%1"".'"),
			ПакетОбъект.СтатусОбменаСАрхивом);
		ЛогированиеОперацийОбменаСАрхивом(
			СобытиеЖурналаРегистрацииОбработкаОтчетов(),
			УровеньЖурналаРегистрации.Информация,
			НСтр("ru = 'Загружен отчет по пакету документов.'"),
			ТекстСообщения,
			ПакетСсылка);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ЗагрузитьУничтожениеДел(ФайлОписанияДокументаУничтожениеДел, КаталогИзвлеченныхФайлов)

	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектXDTOУничтожениеДел = ПрочитатьОбъектXDTOИзФайла(ФайлОписанияДокументаУничтожениеДел.ПолноеИмя);

	НачатьТранзакцию();

	Попытка
		
		ОшибкиЗагрузки = Новый Массив;
		УничтоженныеДокументыБИА = Новый Массив;
		КодДляОбменаС1САрхивом = Константы.ИнтеграцияС1САрхивомКодБазы.Получить();
		
		Для Каждого СтрокаДелаXDTO Из ОбъектXDTOУничтожениеДел.StorageUnits Цикл
				
			ИмяФайлаРеестра = СтрокаДелаXDTO.DocumentsList;
			НайденныеФайлы = НайтиФайлы(КаталогИзвлеченныхФайлов, ИмяФайлаРеестра, Истина);
			Если НайденныеФайлы.Количество() = 0 Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найден контейнер реестра документов %1'"),
					ИмяФайлаРеестра);
			КонецЕсли;
			
			ВременныйКаталогФайлаДляАвтоматическойПроверки = ИзвлечьФайлыИзАрхива(НайденныеФайлы[0].ПолноеИмя);
			ФайлДляАвтоматическойПроверки = НайтиФайлы(ВременныйКаталогФайлаДляАвтоматическойПроверки, "machine.xml", Истина);
			Если ФайлДляАвтоматическойПроверки.Количество() = 0 Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найден файл реестра документов machine.xml в контейнере %1'"),
					ИмяФайлаРеестра);
			КонецЕсли;
			
			РеестрXDTO = ПрочитатьОбъектXDTOИзФайла(ФайлДляАвтоматическойПроверки[0].ПолноеИмя);
			Для Каждого СтрокаДокумента Из РеестрXDTO.Documents Цикл
				Если СтрокаДокумента.SourceID <> КодДляОбменаС1САрхивом Тогда
					Продолжить;
				КонецЕсли;
				ДокументСсылка = Справочники.ДокументыБИА.ПолучитьСсылку(
					Новый УникальныйИдентификатор(СтрокаДокумента.ID));
				Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
					ОшибкиЗагрузки.Добавить(СтрШаблон(
						НСтр("ru = 'Не найден документ с ID %1 из реестра'"), СтрокаДокумента.ID));
					Продолжить;
				КонецЕсли;
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.Уничтожен = Истина;
				ДокументОбъект.ДатаУничтожения = ОбъектXDTOУничтожениеДел.Date;
				ДокументОбъект.Записать();
				РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(ДокументСсылка,
					Перечисления.СобытияОбменаС1САрхивом.УничтожениеДокумента,
					НСтр("ru = 'Загружена информация об уничтожении документа'"));
				УничтоженныеДокументыБИА.Добавить(ДокументСсылка);
			КонецЦикла;
			
			УдалитьФайлы(ВременныйКаталогФайлаДляАвтоматическойПроверки);
			
			Если ОшибкиЗагрузки.Количество() > 0 Тогда
				ТекстОшибки = СтрСоединить(ОшибкиЗагрузки, Символы.ПС);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
		КонецЦикла;
		
		// Вычисление прикладных объектов, по которым уничтожены все документы БИА.
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование
			|ИЗ
			|	Справочник.ДокументыБИА КАК ДокументыБИА
			|ГДЕ
			|	НЕ ДокументыБИА.ПометкаУдаления
			|	И ДокументыБИА.ОбъектОснование В
			|			(ВЫБРАТЬ
			|				ДокументыБИАУничтоженные.ОбъектОснование
			|			ИЗ
			|				Справочник.ДокументыБИА КАК ДокументыБИАУничтоженные
			|			ГДЕ
			|				ДокументыБИАУничтоженные.Ссылка В (&УничтоженныеДокументыБИА))
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументыБИА.ОбъектОснование
			|
			|ИМЕЮЩИЕ
			|	МИНИМУМ(ДокументыБИА.Уничтожен) = ИСТИНА");
		Запрос.УстановитьПараметр("УничтоженныеДокументыБИА", УничтоженныеДокументыБИА);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ОбъектыОснования = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
			ОбменСАрхивомПереопределяемый.УдалитьДанныеДокументовУничтоженныхВАрхиве(
				ОбъектыОснования);
			Для Каждого ОбъектОснование Из ОбъектыОснования Цикл
				РегистрыСведений.ДокументыОтправленныеВ1САрхив.Добавить(ОбъектОснование, Истина);
			КонецЦикла;
		КонецЕсли;
		
		ОписаниеСтрока = НСтр("ru = 'Загружена информация об уничтожении документов'");
		ЛогированиеОперацийОбменаСАрхивом(
			СобытиеЖурналаРегистрацииУничтожениеДел(),
			УровеньЖурналаРегистрации.Информация,
			ОписаниеСтрока);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ИзвлечьФайлыИзАрхива(ZipФайл)
	
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла("") + ПолучитьРазделительПути();
	СоздатьКаталог(ИмяВременногоКаталога);
	
	Попытка
		ЧтениеZipФайла = Новый ЧтениеZipФайла(ZipФайл);
		ПакетДокументовНеПустой = ЧтениеZipФайла.Элементы.Количество() > 0;
		Если ПакетДокументовНеПустой Тогда
			ЧтениеZipФайла.ИзвлечьВсе(ИмяВременногоКаталога);
			ЧтениеZipФайла.Закрыть();
		Иначе
			ЗаписьЖурналаРегистрации(
				СобытиеЖурналаРегистрацииОбработкаОтчетов(),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			УдалитьФайлы(ИмяВременногоКаталога);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииОбработкаОтчетов(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		УдалитьФайлы(ИмяВременногоКаталога);
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ИмяВременногоКаталога;
	
КонецФункции

// Читает файл обмена и возвращает соответствующий объект XDTO.
//
// Параметры:
//  ПолноеИмяФайла - Строка - имя файла.
//
// Возвращаемое значение:
//  ОбъектXDTO - объект.
//  НеобязательныеСвойства - Массив из строк - массив имен свойств, которые не проверяем.
//
Функция ПрочитатьОбъектXDTOИзФайла(ПолноеИмяФайла, НеобязательныеСвойства = Неопределено)
	
	Попытка
		Если СтрЗаканчиваетсяНа(ПолноеИмяФайла, ".xml") Тогда
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
			ЧтениеXML.ПерейтиКСодержимому();
			ПространствоИменОбъекта = ЧтениеXML.URIПространстваИмен;
			ИмяТипаОбъекта = ЧтениеXML.Имя;
			ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПространствоИменОбъекта, ИмяТипаОбъекта);
			ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
			
			ОшибкиЗаполнения = ПроверитьЗаполнениеСвойствXDTO(ОбъектXDTO, Истина, НеобязательныеСвойства);
			Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
				ВызватьИсключение ОшибкиЗаполнения;
			КонецЕсли;
			
			ЧтениеXML.Закрыть();
		ИначеЕсли СтрЗаканчиваетсяНа(ПолноеИмяФайла, ".json") Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.ОткрытьФайл(ПолноеИмяФайла);
			ОбъектXDTO = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Иначе
			ВызватьИсключение НСтр("ru = 'Неожиданный тип файла'");
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при чтении файла %1:
			|%2'"), ПолноеИмяФайла, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ТекущаяОтметкаВремени() Экспорт
	
	ОтметкаЧислом = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОтметкаДатой = Дата(1, 1, 1) + Цел(ОтметкаЧислом / 1000);
	Миллисекунд = ОтметкаЧислом % 1000;
	
	Текущая = Формат(ОтметкаДатой, "ДФ=yyyyMMddHHmmss")
		+ Формат(Миллисекунд, "ЧЦ=3; ЧН=000; ЧВН=; ЧГ=0");
		
	Возврат Текущая;
	
КонецФункции

Процедура ОбработчикПодпискиПередЗаписью(Источник, Отказ,
			РежимЗаписи = Неопределено, РежимПроведения = Неопределено)
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ИгнорироватьПроверкуВыгрузкиВ1САрхив")
			И Источник.ДополнительныеСвойства.ИгнорироватьПроверкуВыгрузкиВ1САрхив = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЕстьДокументыБИАПоОбъекту(Источник.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru = 'Документ отмечен к выгрузке в 1С:Архив. Изменение запрещено.'");
	ТаблицаДокументовБИА = ТаблицаДокументовБИА(Источник.Ссылка);
	СтатусыМенеджер = Перечисления.СтатусыОбменаС1САрхивом;
	Для Каждого Стр Из ТаблицаДокументовБИА Цикл
		Если Стр.Статус = СтатусыМенеджер.ВыгрузкаВыполнена
				Или Стр.Статус = СтатусыМенеджер.ЗагрузкаВАрхивВыполнена
				Или Стр.Статус = СтатусыМенеджер.ПринятВАрхив 
				Или Стр.Статус = СтатусыМенеджер.ОбнаруженыОшибкиПриЗагрузкеВАрхив 
				Или Стр.Статус = СтатусыМенеджер.ОбнаруженыОшибкиПриПроверкеВАрхиве Тогда
			ТекстОшибки = НСтр("ru = 'Документ выгружен в 1С:Архив. Изменение запрещено.'");
		КонецЕсли;
	КонецЦикла;
	
	ВызватьИсключение ТекстОшибки;
	
КонецПроцедуры

Функция ТипИЗначениеДопСвойстваДляВыгрузки(Знач ВыгружаемоеЗначение, Знач ТипыXDTOПоТипамЗначений = Неопределено)
	
	Результат = Новый Структура("Тип, Значение");
	
	Если ТипыXDTOПоТипамЗначений = Неопределено Тогда
		ТипыXDTOПоТипамЗначений = ТипыXDTOПоТипамЗначений();
	КонецЕсли;
	
	Результат.Тип = ТипыXDTOПоТипамЗначений[ТипЗнч(ВыгружаемоеЗначение)];
	Если Не ЗначениеЗаполнено(Результат.Тип) Тогда
		// Если тип не определен, значение передается в виде строкового представления.
		Результат.Тип = ТипыXDTOПоТипамЗначений[Тип("Строка")];
		ВыгружаемоеЗначение = Строка(ВыгружаемоеЗначение);
	КонецЕсли;
	ТипЗначенияСвойства = ТипЗнч(ВыгружаемоеЗначение);
	
	Если Не ЗначениеЗаполнено(ВыгружаемоеЗначение) Тогда
		Результат.Значение = "";
	ИначеЕсли ТипЗначенияСвойства = Тип("Дата") Тогда
		Результат.Значение = Формат(ВыгружаемоеЗначение, "ДФ=ггггММддЧЧммсс");
	ИначеЕсли ЭтоПримитивныйТип(ТипЗначенияСвойства) Тогда
		Результат.Значение = ВыгружаемоеЗначение;
	Иначе
		Результат.Значение = ИдентификаторСсылки(ВыгружаемоеЗначение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПримитивныйТип(Тип)
	
	Возврат Тип = Тип("Строка")
		Или Тип = Тип("Число")
		Или Тип = Тип("Булево")
		Или Тип = Тип("Дата");
	
КонецФункции

Функция ЕстьДокументыБИАПоОбъекту(СсылкаНаОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|ГДЕ
		|	ДокументыБИА.ОбъектОснование = &ОснованиеСсылка
		|	И НЕ ДокументыБИА.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ОснованиеСсылка", СсылкаНаОбъект);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Формирует файл выгрузки указанного пакета документов.
//
// Параметры:
//  Пакет - СправочникСсылка.ПакетыДокументовДля1САрхива - выгружаемый пакет.
//
// Возвращаемое значение:
//  Строка, Неопределено - имя временного файла zip с результатом выгрузки. Этот файл будет перемещен в каталог обмена.
//   Если в пакете нет документов для выгрузки, возвращается Неопределено.
//
Функция ФайлПакетаДокументов(Пакет)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыБИА.Ссылка КАК Ссылка,
		|	ДокументыБИА.Номер КАК Number,
		|	ДокументыБИА.Дата КАК Date,
		|	ДокументыБИА.ЭтоЭлектронныйДокумент КАК ElectronicDocument,
		|	ДокументыБИА.ВидДокумента КАК ВидДокумента,
		|	ДокументыБИА.Заголовок КАК Header,
		|	ДокументыБИА.Организация КАК Организация,
		|	ДокументыБИА.Подразделение КАК Подразделение,
		|	ДокументыБИА.ГрифДоступа КАК ГрифДоступа,
		|	ДокументыБИА.КоличествоЛистов КАК SheetsNumber,
		|	ДокументыБИА.КоличествоПриложений КАК AdditionsNumber,
		|	ДокументыБИА.ЛистовВПриложениях КАК AdditionsSheetsNumber,
		|	ДокументыБИА.Проект КАК Проект,
		|	ДокументыБИА.Содержание КАК Содержание,
		|	ДокументыБИА.Валюта КАК Валюта,
		|	ДокументыБИА.Сумма КАК Сумма,
		|	ДокументыБИА.СуммаНДС КАК СуммаНДС,
		|	ДокументыБИА.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ДокументыБИА.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ДокументыБИА.Комментарий КАК Комментарий,
		|	ДокументыБИА.Контрагент КАК Контрагент,
		|	ДокументыБИА.ЭДОДата КАК ЭДОДата,
		|	ДокументыБИА.ЭДОНаправление КАК ЭДОНаправление,
		|	ДокументыБИА.ЭДОНомер КАК ЭДОНомер,
		|	ДокументыБИА.ВизыСогласования КАК ВизыСогласования,
		|	ДокументыБИА.ДополнительныеТабЧасти КАК ДополнительныеТабЧасти,
		|	ДокументыБИА.ПодписиДокумента КАК ПодписиДокумента,
		|	ДокументыБИА.ПрочиеСвойства КАК ПрочиеСвойства,
		|	ДокументыБИА.Резолюции КАК Резолюции,
		|	ДокументыБИА.Связи КАК Связи,
		|	ДокументыБИА.СтатусыФайловЭДО КАК СтатусыФайловЭДО,
		|	ДокументыБИА.СубъектыПерсональныхДанных КАК СубъектыПерсональныхДанных,
		|	ДокументыБИА.Файлы КАК Файлы,
		|	ДокументыБИА.Штрихкоды КАК Штрихкоды
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ДокументыПакета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
		|		ПО ДокументыПакета.Документ = ДокументыБИА.Ссылка
		|ГДЕ
		|	ДокументыБИА.ПометкаУдаления = ЛОЖЬ
		|	И ДокументыПакета.Ссылка = &Пакет";
	Запрос.УстановитьПараметр("Пакет", Пакет);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстОшибки = "";
	ИмяФайла = ПолучитьИмяВременногоФайла("zip");
	ЗаписьZipФайлаПакетДокументов = Новый ЗаписьZipФайла(ИмяФайла);
	
	РеквизитыПакета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(	
		Пакет, "Идентификатор,Код,Организация,Подразделение,ГрифДоступа,Передал,ДатаПередачи,Комментарий,Документы");
	Организация = РеквизитыПакета.Организация;
	Подразделение = РеквизитыПакета.Подразделение;
	ГрифДоступа = РеквизитыПакета.ГрифДоступа;
	Передал = РеквизитыПакета.Передал;
	ДатаПередачи = РеквизитыПакета.ДатаПередачи;
	
	ПространствоИменСхемы = ВерсияФорматаДляОтправкиСообщений();
	ПакетДокументовXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменСхемы, "DocumentPackage"));
	СвойстваПакетаXDTO = ПакетДокументовXDTO.Свойства();
	ПакетДокументовXDTO.ID = РеквизитыПакета.Идентификатор;
	ПакетДокументовXDTO.SourceID = СокрЛП(Константы.ИнтеграцияС1САрхивомКодБазы.Получить());
	ПакетДокументовXDTO.Number = ?(ЗначениеЗаполнено(РеквизитыПакета.Код), РеквизитыПакета.Код, "");
	ПакетДокументовXDTO.OrganizationID = ?(ЗначениеЗаполнено(Организация), ИдентификаторСсылки(Организация), "");
	ПакетДокументовXDTO.DepartmentID = ?(ЗначениеЗаполнено(Подразделение), ИдентификаторСсылки(Подразделение), "");
	ПакетДокументовXDTO.SecurityLevelID = ?(ЗначениеЗаполнено(ГрифДоступа), ИдентификаторСсылки(ГрифДоступа), "");
	ПакетДокументовXDTO.SenderID = ?(ЗначениеЗаполнено(Передал), ИдентификаторСсылки(Передал), "");
	ПакетДокументовXDTO.Comment = РеквизитыПакета.Комментарий;
	Если СвойстваПакетаXDTO.Получить("DateSent") <> Неопределено Тогда
		ПакетДокументовXDTO.DateSent = ?(ЗначениеЗаполнено(ДатаПередачи),
			ДатаПередачи, ТекущаяДатаСеанса());
	КонецЕсли;
	
	ВременнаяПапка = ПолучитьИмяВременногоФайла("") + ПолучитьРазделительПути();
	СоздатьКаталог(ВременнаяПапка);
	
	ПорядковыйНомерКонтейнера = 1;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибкиПоДокументу = "";
		ПредставлениеДокумента = ПолучитьНавигационнуюСсылку(Выборка.Ссылка);
		
		Если ЗначениеЗаполнено(Организация) И Выборка.Организация <> Организация Тогда
			ТекстОшибкиПоДокументу = ТекстОшибкиПоДокументу + Символы.ПС
				+ НСтр("ru = 'организация не соответствует выбранной'");
		КонецЕсли;
		Если ЗначениеЗаполнено(Подразделение) И Выборка.Подразделение <> Подразделение Тогда
			ТекстОшибкиПоДокументу = ТекстОшибкиПоДокументу + Символы.ПС
				+ НСтр("ru = 'подразделение не соответствует выбранному'");
		КонецЕсли;
		Если ЗначениеЗаполнено(ГрифДоступа) И Выборка.ГрифДоступа <> ГрифДоступа Тогда
			ТекстОшибкиПоДокументу = ТекстОшибкиПоДокументу + Символы.ПС
				+ НСтр("ru = 'гриф доступа не соответствует выбранному'");
		КонецЕсли;
		
		ДобавитьДокументВПакет(Выборка, ПакетДокументовXDTO, ЗаписьZipФайлаПакетДокументов,
			ВременнаяПапка, ПорядковыйНомерКонтейнера, ТекстОшибкиПоДокументу);
		Если ЗначениеЗаполнено(ТекстОшибкиПоДокументу) Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС
				+ СтрШаблон(НСтр("ru = 'Не удалось выгрузить документ %1 по причине: %2'"),
					ПредставлениеДокумента, ТекстОшибкиПоДокументу);
		КонецЕсли;
		
		ПорядковыйНомерКонтейнера = ПорядковыйНомерКонтейнера + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	// Запись пакета документов.
	ИмяФайлаОписания = ВременнаяПапка + "DocumentPackage.xml";
	
	ПотокЗаписи = Новый ЗаписьXML();
	ПотокЗаписи.ОткрытьФайл(ИмяФайлаОписания);
	ПотокЗаписи.ЗаписатьОбъявлениеXML();
	ФабрикаXDTO.ЗаписатьXML(ПотокЗаписи, ПакетДокументовXDTO,,,, НазначениеТипаXML.Явное);
	ПотокЗаписи.Закрыть();
	ЗаписьZipФайлаПакетДокументов.Добавить(ИмяФайлаОписания);
	ЗаписьZipФайлаПакетДокументов.Записать();
	
	Если ЗначениеЗаполнено(ВременнаяПапка) Тогда
		УдалитьФайлы(ВременнаяПапка);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Процедура ПриСозданииНаСервереФормыСписка(Форма, ПараметрыРазмещения)
	
#Если Не ВнешнееСоединение Тогда
	
	Если ПараметрыРазмещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСписка = "Список";
	ПараметрыРазмещения.Свойство("ИмяСписка", ИмяСписка);
	Если Не ЗначениеЗаполнено(ИмяСписка) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ТаблицаФормы = Элементы.Найти(СокрЛП(ИмяСписка));
	Если ТаблицаФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСписок = Форма[ТаблицаФормы.ПутьКДанным];
	ОсновнаяТаблица = ТекущийСписок.ОсновнаяТаблица;
	Если Не ЗначениеЗаполнено(ОсновнаяТаблица) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДокументыОтправленныеВ1САрхив) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "";
	Если ТекущийСписок.ПроизвольныйЗапрос Тогда
		ТекстЗапроса = ТекущийСписок.ТекстЗапроса;
	Иначе
		ИсполняемаяСхема = ТаблицаФормы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		НаборДанныхДинамическогоСписка = ИсполняемаяСхема.НаборыДанных.Найти("НаборДанныхДинамическогоСписка");
		Если НаборДанныхДинамическогоСписка <> Неопределено Тогда
			ТекущийСписок.ПроизвольныйЗапрос = Истина;
			ТекстЗапроса = НаборДанныхДинамическогоСписка.Запрос;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Или Не СтрНачинаетсяС(ТекстЗапроса, "ВЫБРАТЬ") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = "СтатусОбмена";
	ИмяКолонкиОбъекта = ПараметрыРазмещения.ИмяКолонкиОбъекта;
	Если Не ЗначениеЗаполнено(ИмяКолонкиОбъекта) Тогда
		ИмяКолонкиОбъекта = "Ссылка";
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорПоследнегоЗапроса = ПоследнийЗапрос.Операторы[0];
	ПервыйИсточник = ОператорПоследнегоЗапроса.Источники[0];
	
	НовыйИсточник = ОператорПоследнегоЗапроса.Источники.Добавить(
		"РегистрСведений.ДокументыОтправленныеВ1САрхив", "ДокументыОтправленныеВ1САрхив");
	УсловиеСоединения = СтрШаблон("%1.%2 = ДокументыОтправленныеВ1САрхив.Документ",
		ПервыйИсточник.Источник.Псевдоним, ИмяКолонкиОбъекта);
	ПервыйИсточник.Соединения.Добавить(НовыйИсточник.Источник.Псевдоним, УсловиеСоединения);
	
	ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА ДокументыОтправленныеВ1САрхив.Уничтожен = ИСТИНА
		|		ТОГДА 1
		|	КОГДА ДокументыОтправленныеВ1САрхив.Уничтожен = ЛОЖЬ
		|		ТОГДА 0
		|	ИНАЧЕ -1
		|КОНЕЦ"; 
	
	ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
	ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = ИмяКолонки;
	
	НовыйТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КоличествоПроверяемыхПолей = 1000;
	// Обход ошибки с лишними псевдонимами.
	Для Счетчик = 0 По КоличествоПроверяемыхПолей Цикл
		СтрокаПсевдонима = "КАК Поле" + Формат(КоличествоПроверяемыхПолей - Счетчик, "ЧГ=");
		Если СтрНайти(НовыйТекстЗапроса, СтрокаПсевдонима) > 0
				И СтрНайти(ТекстЗапроса, СтрокаПсевдонима) = 0 Тогда
			НовыйТекстЗапроса = СтрЗаменить(НовыйТекстЗапроса, СтрокаПсевдонима, "");
		КонецЕсли;
	КонецЦикла;
	
	СтруктураСвойствДинамическогоСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СтруктураСвойствДинамическогоСписка.ТекстЗапроса = НовыйТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(ТаблицаФормы, СтруктураСвойствДинамическогоСписка);
	
	ОбменСАрхивомПереопределяемый.ПриСозданииНаСервере(Форма, ПараметрыРазмещения, Ложь);

	КолонкаСтатусОбмена = Элементы.Найти(ИмяКолонки);
	Если КолонкаСтатусОбмена = Неопределено Тогда
		
		КолонкаСтатусОбмена = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		КолонкаСтатусОбмена.Вид                = ВидПоляФормы.ПолеКартинки;
		КолонкаСтатусОбмена.ПутьКДанным        = СтрШаблон("%1.%2", ИмяСписка, ИмяКолонки);
		КолонкаСтатусОбмена.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		КолонкаСтатусОбмена.КартинкаЗначений   = БиблиотекаКартинок.КоллекцияСостоянияДокументовДля1САрхива;
		КолонкаСтатусОбмена.Подсказка = НСтр("ru = 'Статус обмена с 1С:Архивом'");
		
		КолонкиСписка = ТаблицаФормы.ПодчиненныеЭлементы;
		Если КолонкиСписка.Количество() > 0 Тогда
			ЛеваяКолонка = КолонкиСписка.Получить(0);
			Элементы.Переместить(КолонкаСтатусОбмена, ТаблицаФормы, ЛеваяКолонка);
			Если ЛеваяКолонка.ФиксацияВТаблице = ФиксацияВТаблице.Лево Тогда
				КолонкаСтатусОбмена.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
#Иначе
	ВызватьИсключение НСтр(
		"ru = 'Метод ""ОбменСАрхивом.ПриСозданииНаСервереФормыСписка"" недоступен во внешнем соединении.'");
#КонецЕсли
	
КонецПроцедуры

// Заполняет объект НСИ для отправки в Архив.
//
// Параметры:
//  СсылкиНаОбъектыНСИ - Массив из СправочникСсылка - ссылки на выгружаемые объекты НСИ.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение
//   * Ключ - СправочникСсылка - ссылка на объект НСИ.
//   * Значение - ОбъектXDTO, Строка - объект для отправки в Архив, либо сообщение об ошибке заполнения объекта.
//
Функция ЗаполнитьXDTOОбъектыНСИ(СсылкиНаОбъектыНСИ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Соответствие;
	Если СсылкиНаОбъектыНСИ.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(СсылкиНаОбъектыНСИ[0]);
	ИменаТиповXDTO = ТипыXDTOПоТипамЗначений();
	ПространствоИменСхемы = ВерсияФорматаДляОтправкиСообщений();
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПространствоИменСхемы, ИменаТиповXDTO[ТипОбъекта]);
	Если ТипОбъектаXDTO = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Неожиданный тип объекта НСИ: %1. Объект: %2'"),
			ТипОбъекта, СсылкиНаОбъектыНСИ[0]);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ТабДанныхНСИ = Неопределено;
	Если ТипОбъекта = Тип("СправочникСсылка.ВидыДокументовБИА") Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Ссылка,
			|	Таблица.Родитель КАК Родитель,
			|	Таблица.Наименование КАК Name,
			|	Таблица.ПометкаУдаления КАК DeletionMark,
			|	ВЫРАЗИТЬ("""" КАК Строка(36)) КАК ID,
			|	ВЫРАЗИТЬ("""" КАК Строка(36)) КАК FolderID,
			|	ВЫРАЗИТЬ("""" КАК Строка(36)) КАК ParentID
			|ИЗ
			|	Справочник.ВидыДокументовБИА КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В(&СсылкиНаОбъектыНСИ)");
		Запрос.УстановитьПараметр("СсылкиНаОбъектыНСИ", СсылкиНаОбъектыНСИ);
		ТабДанныхНСИ = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрНСИ Из ТабДанныхНСИ Цикл
			СтрНСИ.ID = ИдентификаторСсылки(СтрНСИ.Ссылка);
			Если ЗначениеЗаполнено(СтрНСИ.Родитель) Тогда
				СтрНСИ.ParentID = ИдентификаторСсылки(СтрНСИ.Родитель);
				СтрНСИ.FolderID = ИдентификаторСсылки(СтрНСИ.Родитель); // Для версии формата 1.0.3.
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.СотрудникиБИА") Тогда	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Ссылка,
			|	Таблица.Наименование КАК Name,
			|	Таблица.ПометкаУдаления КАК DeletionMark,
			|	Таблица.ФизическоеЛицо КАК ФизЛицо,
			|	Таблица.Подразделение КАК Подразделение,
			|	Таблица.Должность КАК Должность,
			|	Таблица.ЭтоОсновнойСотрудникФизЛица КАК IsMain,
			|	Таблица.ДатаНачалаДействия КАК EffectiveDate,
			|	Таблица.ДатаОкончанияДействия КАК ExpirationDate,
			|	ВЫРАЗИТЬ("""" КАК Строка(36)) КАК ID,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК IndividualID,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК TitleID,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК DepartmentID
			|ИЗ
			|	Справочник.СотрудникиБИА КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В(&СсылкиНаОбъектыНСИ)");
		Запрос.УстановитьПараметр("СсылкиНаОбъектыНСИ", СсылкиНаОбъектыНСИ);
		ТабДанныхНСИ = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрНСИ Из ТабДанныхНСИ Цикл
			СтрНСИ.ID = ИдентификаторСсылки(СтрНСИ.Ссылка);
			Если ЗначениеЗаполнено(СтрНСИ.ФизЛицо) Тогда
				СтрНСИ.IndividualID = ИдентификаторСсылки(СтрНСИ.ФизЛицо);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрНСИ.Должность) Тогда
				СтрНСИ.TitleID = ИдентификаторСсылки(СтрНСИ.Должность);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрНСИ.Подразделение) Тогда
				СтрНСИ.DepartmentID = ИдентификаторСсылки(СтрНСИ.Подразделение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТабДанныхНСИ = ОбменСАрхивомПереопределяемый.ТаблицаДанныхНСИДляВыгрузки(
			СсылкиНаОбъектыНСИ, ТипОбъектаXDTO);
	КонецЕсли;
	
	Если ТипЗнч(ТабДанныхНСИ) <> Тип("ТаблицаЗначений") Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось вычислить данные объектов НСИ ""%1""'"), ТипОбъекта);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ДоступныеСвойства = Новый Соответствие;
	Для Каждого Колонка Из ТабДанныхНСИ.Колонки Цикл
		ДоступныеСвойства.Вставить(Колонка.Имя, Истина);
	КонецЦикла;
	Для Каждого СтрНСИ Из ТабДанныхНСИ Цикл
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		Для Каждого СвойствоXDTO Из ОбъектXDTO.Свойства() Цикл
			ИмяСвойства = СвойствоXDTO.Имя;
			Если ДоступныеСвойства[ИмяСвойства] <> Неопределено Тогда
				ОбъектXDTO[ИмяСвойства] = ?(СтрНСИ[ИмяСвойства] = Null, Неопределено, СтрНСИ[ИмяСвойства]);
			КонецЕсли;
		КонецЦикла;
		ОшибкиЗаполнения = ПроверитьЗаполнениеСвойствXDTO(ОбъектXDTO);
		Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
			Результат.Вставить(СтрНСИ.Ссылка, ОшибкиЗаполнения);
		Иначе
			Результат.Вставить(СтрНСИ.Ссылка, ОбъектXDTO);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьДокументыБИА(Ссылка, МенеджерОбъекта)
	
	ДокументыБИА = ОбменСАрхивомПереопределяемый.СоздатьДокументыБИА(Ссылка);
	
	Если ДокументыБИА = Неопределено Тогда
		ДокументыБИА = МенеджерОбъекта.СоздатьДокументыБИА(Ссылка);
	КонецЕсли;
	
	Возврат ДокументыБИА;
	
КонецФункции

Функция ЭтоФормаОбъекта(Форма)
	
#Если Не ВнешнееСоединение Тогда
	
	ЭтоФормаОбъекта = ОбменСАрхивомПереопределяемый.ЭтоФормаОбъекта(Форма);
	
	Если ТипЗнч(ЭтоФормаОбъекта) <> Тип("Булево") Тогда
		ЭтоФормаОбъекта = Форма.Параметры.Свойство("Ключ");
	КонецЕсли;
	
	Возврат ЭтоФормаОбъекта;
	
#Иначе
	ВызватьИсключение НСтр(
		"ru = 'Метод ""ОбменСАрхивом.ЭтоФормаОбъекта"" недоступен во внешнем соединении.'");
#КонецЕсли
	
КонецФункции

Функция ОбъектИзФормы(Форма)
	
	ИмяРеквизитаХранящегоОбъект = 
		ОбменСАрхивомПереопределяемый.ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма);
	
	Если Не ЗначениеЗаполнено(ИмяРеквизитаХранящегоОбъект) Тогда
		ИмяРеквизитаХранящегоОбъект = "Объект";
	КонецЕсли;
	
	Объект = Форма[ИмяРеквизитаХранящегоОбъект];
	
	Возврат Объект;
	
КонецФункции

// Возвращает запрос, вычисляющий ЭП файлов документа из регистра ЭлектронныеПодписи.
//
// Возвращаемое значение:
//  Запрос - запрос по ЭП.
//
Функция ЗапросПоЭлектроннымПодписям()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПодписейДокументовБИА.Усиленная) КАК ВидПодписи,
		|	ЭП.ДатаПодписи КАК ДатаПодписи,
		|	ЭП.КомуВыданСертификат КАК Подписал,
		|	ЭП.Подпись КАК Подпись,
		|	ЭП.ПодписанныйОбъект КАК Файл,
		|	ЭП.ПодписьВерна КАК ПодписьВерна,
		|	ЭП.Сертификат КАК Сертификат,
		|	МашиночитаемыеДоверенности.НомерДоверенности КАК НомерДоверенности
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭП
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписиМЧД КАК ЭлектронныеПодписиМЧД
		|		ПО ЭП.ПодписанныйОбъект = ЭлектронныеПодписиМЧД.ПодписанныйОбъект
		|			И ЭП.ИдентификаторПодписи = ЭлектронныеПодписиМЧД.ИдентификаторПодписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
		|		ПО ЭлектронныеПодписиМЧД.МашиночитаемаяДоверенность = МашиночитаемыеДоверенности.Ссылка
		|ГДЕ
		|	ЭП.ПодписанныйОбъект В(&ФайлыДокумента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПодписейДокументовБИА.Усиленная),
		|	ЭП.ДатаПодписи,
		|	ЭП.КомуВыданСертификат,
		|	ЭП.Подпись,
		|	ЭП.ПодписанныйОбъект,
		|	NULL,
		|	ЭП.Сертификат,
		|	МашиночитаемыеДоверенности.НомерДоверенности
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭП
		|		ПО Файлы.ТекущаяВерсия = ЭП.ПодписанныйОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписиМЧД КАК ЭлектронныеПодписиМЧД
		|		ПО ЭП.ПодписанныйОбъект = ЭлектронныеПодписиМЧД.ПодписанныйОбъект
		|			И ЭП.ИдентификаторПодписи = ЭлектронныеПодписиМЧД.ИдентификаторПодписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
		|		ПО ЭлектронныеПодписиМЧД.МашиночитаемаяДоверенность = МашиночитаемыеДоверенности.Ссылка
		|ГДЕ
		|	Файлы.Ссылка В(&ФайлыДокумента)");
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСведенияОПодписантеИзСертификата(СертификатПодписанта, СтрокаПодписи)
	
	ДанныеСертификата = СертификатПодписанта.Получить();
	Если Не ЗначениеЗаполнено(ДанныеСертификата) Тогда
		Возврат;
	КонецЕсли;
	
	Сертификат = Новый СертификатКриптографии(ДанныеСертификата);
	
	Субъект = Сертификат.Субъект;
	Фамилия = "";
	Имя = "";

	Если Субъект.Свойство("SN") Тогда
		Фамилия = СокрЛП(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML((Субъект.SN)));
	КонецЕсли;
	
	Если Субъект.Свойство("GN") Тогда
		Имя = СокрЛП(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML((Субъект.GN)));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фамилия) Или ЗначениеЗаполнено(Имя) Тогда
		СтрокаПодписи.Подписал = Фамилия + " " + Имя;
	КонецЕсли;
	
	Если Субъект.Свойство("T") Тогда
		СтрокаПодписи.Должность = СокрЛП(
			ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML((Субъект.T)));
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение свойств объекта XDTO разными методами в зависимости от версии формата обмена
// - с помощью строенного метода Проверить() при загрузке данных
// - все свойства объекта XDTO, включая подчиненные при выгрузке данных
// - только свойства объекта XDTO одного уровня, без подчиненных при выгрузке данных
// Используется, начиная с версии формата обмена АДХ 1.0.11
// Можно передать в массиве НеобязательныеСвойства - свойства, которые не нужно проверять.
//
Функция ПроверитьЗаполнениеСвойствXDTO(ОбъектXDTO, ЭтоЗагрузкаДанных = Ложь, НеобязательныеСвойства = Неопределено)
	
	СвойствоЭтоГруппа = ОбъектXDTO.Свойства().Получить("IsFolder");
	Если СвойствоЭтоГруппа <> Неопределено
		И ОбъектXDTO.IsFolder = Истина Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НеобязательныеСвойства) Тогда
		НеобязательныеСвойства = Новый Массив;
	КонецЕсли;
	
	// Новая версия формата обмена, начиная с АДХ 1.0.11
	ЭтоНоваяВерсияФормата = СравнитьВерсииФормата(ОбъектXDTO.Тип().URIПространстваИмен,
		Метаданные.ПакетыXDTO.АДХ_1_0_10.ПространствоИмен) > 0;
	
	// Проверка объекта XDTO встроенным методом Проверить(),
	// для версий формата обмена до АДХ 1.0.10 включительно при загрузке данных.
	// Используется начиная с версии БИА 1.0.3
	//
	Если ЭтоЗагрузкаДанных И Не ЭтоНоваяВерсияФормата Тогда
		ТекстОшибки = "";
		Попытка
			ОбъектXDTO.Проверить();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Проверка значений свойств объекта XDTO без подчиненных для старых версий формата обмена до АДХ 1.0.11 включительно
	// и с подчиненными для новых версий формата обмена.
	// Используется начиная с версии БИА 1.0.3
	//
	МассивОшибок = Новый Массив;
	ОбъектыДляПроверки = Новый Массив;
	ОбъектыДляПроверки.Добавить(ОбъектXDTO);
	
	ДополнительныеСведенияПоОшибкам = Новый Соответствие;
	
	Пока ОбъектыДляПроверки.Количество() > 0 Цикл
		
		ОбъектДляПроверки = ОбъектыДляПроверки[0];
		ОбъектыДляПроверки.Удалить(0);
		
		Для Каждого СвойствоXDTO Из ОбъектДляПроверки.Свойства() Цикл
			
			Если ТипЗнч(ОбъектДляПроверки[СвойствоXDTO.Имя]) = Тип("ОбъектXDTO") И ЭтоНоваяВерсияФормата Тогда
				ОбъектыДляПроверки.Добавить(ОбъектДляПроверки.ПолучитьXDTO(СвойствоXDTO));
				ДополнительныеСведения =
					СтрШаблон(НСтр("ru = 'в свойстве ""%1""'"),
					ОбъектДляПроверки.Владелец().Тип().Имя);
				ДополнительныеСведенияПоОшибкам.Вставить(ОбъектДляПроверки.ПолучитьXDTO(СвойствоXDTO), ДополнительныеСведения);
			ИначеЕсли ТипЗнч(ОбъектДляПроверки[СвойствоXDTO.Имя]) = Тип("СписокXDTO") И ЭтоНоваяВерсияФормата Тогда
				СтрокиСпискаXDTO = ОбъектДляПроверки.ПолучитьСписок(СвойствоXDTO);
				Если СтрокиСпискаXDTO = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НомерСтроки = 1;
				Для Каждого ЭлементСпискаXDTO Из СтрокиСпискаXDTO Цикл
					ОбъектыДляПроверки.Добавить(ЭлементСпискаXDTO);
					ДополнительныеСведения =
						СтрШаблон(НСтр("ru = 'в свойстве ""%1"" (строка %2)'"),
						СтрокиСпискаXDTO.ВладеющееСвойство.Имя, НомерСтроки);
					ДополнительныеСведенияПоОшибкам.Вставить(ЭлементСпискаXDTO, ДополнительныеСведения);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
			КонецЕсли;
			Если НеобязательныеСвойства.Найти(СвойствоXDTO.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если СвойствоXDTO.НижняяГраница <> 1
				Или СвойствоXDTO.ВозможноПустое = Истина Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбъектДляПроверки[СвойствоXDTO.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			
			ДополнительныеСведения = ДополнительныеСведенияПоОшибкам.Получить(ОбъектДляПроверки);
			Если ЗначениеЗаполнено(ДополнительныеСведения) Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = '%1 не заполнено поле ""%2""'"),
					ДополнительныеСведения,
					СвойствоXDTO.Имя);
			Иначе
				ТекстОшибки = СтрШаблон(НСтр("ru = 'не заполнено поле ""%1""'"),
					СвойствоXDTO.Имя);
			КонецЕсли;
			МассивОшибок.Добавить(ТекстОшибки);
		КонецЦикла;
		
	КонецЦикла;

	Возврат СтрСоединить(МассивОшибок, "; ");
		
КонецФункции

#КонецОбласти
