#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Контрагент", "РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОсновнойБанковскийСчет(Ссылка, ОсновнойСчет) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Ссылка.Владелец);
	НаборЗаписей.Прочитать();
	
	// Текущий счет указан основным.
	Если ОсновнойСчет Тогда
		// есть счет, помеченный как основной
		Если НаборЗаписей.Количество() = 1 Тогда
			
			Если НаборЗаписей[0].БанковскийСчетКонтрагента = Ссылка Тогда
				Возврат;
			Иначе
				НаборЗаписей[0].БанковскийСчетКонтрагента = Ссылка;
			КонецЕсли;
			
		Иначе
			// нет основного счета
			НаборЗаписей.Добавить();
			НаборЗаписей[0].Контрагент = Ссылка.Владелец; 
			НаборЗаписей[0].БанковскийСчетКонтрагента = Ссылка;	
			
		КонецЕсли;	
	// Текущий счет не указан основным.
	Иначе
		// есть счет, помеченный как основной
		Если НаборЗаписей.Количество() = 1 Тогда 
			// не очищаем другой счет, помеченный как основной
			Если НаборЗаписей[0].БанковскийСчетКонтрагента <> Ссылка Тогда
				Возврат;
			Иначе				
				НаборЗаписей.Очистить();
			КонецЕсли;
			
		КонецЕсли;  
	КонецЕсли;	
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли