#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкиЗаполнения

Функция ПроверкаМатериальнойОтветственностиФизическихЛиц(Организация, ФизическиеЛица, ТолькоАктуальные) Экспорт
	
	МатериальнаяОтветственностьФизическихЛиц = Новый Соответствие;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.МатериальноОтветственныеЛица) Тогда
		Возврат МатериальнаяОтветственностьФизическихЛиц;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьМатериальнуюОтветственностьСотрудников") Тогда
		Возврат МатериальнаяОтветственностьФизическихЛиц;
	КонецЕсли;
	
	РегистрыСведений.МатериальноОтветственныеЛица.МатериальнаяОтветственность(Организация, ФизическиеЛица, ТолькоАктуальные, МатериальнаяОтветственностьФизическихЛиц);
	
	Возврат МатериальнаяОтветственностьФизическихЛиц;
	
КонецФункции

#КонецОбласти

#КонецОбласти