
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Элементы.ГруппаИнформация.Видимость = Объект.Уничтожен Или Объект.ПометкаУдаления;
	Если Объект.Уничтожен Тогда
		Элементы.ИнформацияНадпись.Заголовок = СтрШаблон(
			НСтр("ru = 'Документ уничтожен в 1С:Архиве %1'"),
			Формат(Объект.ДатаУничтожения, "ДЛФ=Д"));
	ИначеЕсли Объект.ПометкаУдаления Тогда
		Элементы.ИнформацияНадпись.Заголовок = 
			НСтр("ru = 'Документ помечен на удаление'");
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СтатусыОбменаДокументовБИА.Статус, &СтатусНеГотов) КАК Статус,
		|	СтатусыОбменаДокументовБИА.ПакетДокументов КАК Пакет
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
		|		ПО ДокументыБИА.Ссылка = СтатусыОбменаДокументовБИА.ДокументБИА
		|ГДЕ
		|	ДокументыБИА.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СтатусНеГотов", Перечисления.СтатусыОбменаС1САрхивом.НеГотовКВыгрузке);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусОбмена = Выборка.Статус;
		ПакетДокументов = Выборка.Пакет;
	КонецЕсли;
	
	Элементы.ПакетДокументов.Видимость = ЗначениеЗаполнено(ПакетДокументов);
	Элементы.ФормаВключитьВозможностьРедактирования.Видимость =
		ПравоДоступа("Изменение", Метаданные.Справочники.ДокументыБИА);
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность =
		ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(СтатусОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КолСтрок = Объект.ПрочиеСвойства.Количество();
	Элементы.ГруппаПрочиеСвойства.Заголовок = НСтр("ru = 'Прочие свойства'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.ДополнительныеТабЧасти.Количество();
	Элементы.ГруппаДополнительныеТабЧасти.Заголовок = НСтр("ru = 'Дополнительные таблицы'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.Файлы.Количество();
	Элементы.ГруппаФайлы.Заголовок = НСтр("ru = 'Файлы'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.ПодписиДокумента.Количество();
	Элементы.ГруппаПЭПиБумажныеПодписи.Заголовок = НСтр("ru = 'Подписи (ПЭП и бумажные)'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.СубъектыПерсональныхДанных.Количество();	
	Элементы.ГруппаСубъектыПерсональныхДанных.Заголовок = НСтр("ru = 'Субъекты перс. данных'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.Связи.Количество();	
	Элементы.ГруппаСвязи.Заголовок = НСтр("ru = 'Связи'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.ВизыСогласования.Количество();
	Элементы.ГруппаВизыСогласования.Заголовок = НСтр("ru = 'Визы согласования'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.Резолюции.Количество();
	Элементы.ГруппаРезолюции.Заголовок = НСтр("ru = 'Резолюции'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.СтатусыФайловЭДО.Количество();
	Элементы.ГруппаСтатусыФайловЭДО.Заголовок = НСтр("ru = 'Статусы файлов ЭДО'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
		
	КолСтрок = Объект.Штрихкоды.Количество();
	Элементы.ГруппаШтрихкоды.Заголовок = НСтр("ru = 'Штрихкоды'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрочиеСвойства

&НаКлиенте
Процедура ПрочиеСвойстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущаяКолонка = Элементы.ФайлыФайл И ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Файл);
	ИначеЕсли ТекущаяКолонка = Элементы.ФайлыФайлВизуализации И ЗначениеЗаполнено(ТекущиеДанные.ФайлВизуализации) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ФайлВизуализации);
	ИначеЕсли ТекущаяКолонка = Элементы.ФайлыРоль И ЗначениеЗаполнено(ТекущиеДанные.Роль) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Роль);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПЭПиБумажныеПодписи

&НаКлиенте
Процедура ПЭПиБумажныеПодписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Файл);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСубъектыПерсональныхДанных

&НаКлиенте
Процедура СубъектыПерсональныхДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФизическоеЛицо) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ФизическоеЛицо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязи

&НаКлиенте
Процедура СвязиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СвязанныйДокумент) Тогда
		ПоказатьЗначение(, ТекущиеДанные.СвязанныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВизыСогласования

&НаКлиенте
Процедура ВизыСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущаяКолонка = Элементы.ВизыСогласованияАвтор И ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Автор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезолюции

&НаКлиенте
Процедура РезолюцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущаяКолонка = Элементы.РезолюцииАвтор И ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Автор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыФайловЭДО

&НаКлиенте
Процедура СтатусыФайловЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Файл);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеТабЧасти

&НаКлиенте
Процедура ДополнительныеТабЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
