//////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для операций получения и отправки файлов обмена.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вычисляет параметры, которые необходимо закешировать для сеанса обмена.
//
// Возвращаемое значение:
//  Структура, Неопределено - для разных видов транспорта свойства структуры могут отличаться.
//    Если обмен с указанными параметрами невозможен, возвращается Неопределено.
//
Функция ПараметрыТранспортаДляСеансаОбмена() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыТранспорта = Новый Структура;
	
	КодДляОбменаСАрхивом = СокрЛП(Константы.ИнтеграцияС1САрхивомКодБазы.Получить());
	Если Не ЗначениеЗаполнено(КодДляОбменаСАрхивом) Тогда
		ОбменСАрхивом.ЛогированиеОперацийОбменаСАрхивом(
			ОбменСАрхивом.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НСтр("ru = 'Не указан код в константе ""Код для обмена с 1С:Архивом"".'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ВидТранспорта = Константы.ИнтеграцияС1САрхивомВидТранспорта.Получить();
	ПараметрыТранспорта.Вставить("ВидТранспорта", ВидТранспорта);
	
	Если ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог Тогда
		
		КаталогОбмена = КаталогОбмена();
		Если КаталогОбмена = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			РазделительПути = ПолучитьРазделительПути();
			ПодпапкаФайловВАрхив = КаталогОбмена + КодДляОбменаСАрхивом + "_to_Archive" + РазделительПути;
			ПодпапкаФайловИзАрхива = КаталогОбмена + "Archive_to_" + КодДляОбменаСАрхивом + РазделительПути;
			
			СоздатьКаталог(ПодпапкаФайловВАрхив);	
			СоздатьКаталог(ПодпапкаФайловИзАрхива);
			
			ПараметрыТранспорта.Вставить("ПодпапкаФайловВАрхив", ПодпапкаФайловВАрхив);
			ПараметрыТранспорта.Вставить("ПодпапкаФайловИзАрхива", ПодпапкаФайловИзАрхива);
		Исключение
			ОбменСАрхивом.ЛогированиеОперацийОбменаСАрхивом(
				ОбменСАрхивом.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Неопределено;
		КонецПопытки;
		
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ИнтеграцияС1САрхивомАдресFTP.Значение КАК АдресFTP,
			|	ИнтеграцияС1САрхивомПортFTP.Значение КАК ПортFTP,
			|	ИнтеграцияС1САрхивомПользовательFTP.Значение КАК ПользовательFTP,
			|	ИнтеграцияС1САрхивомПассивныйРежимFTP.Значение КАК ПассивныйРежимFTP
			|ИЗ
			|	Константа.ИнтеграцияС1САрхивомАдресFTP КАК ИнтеграцияС1САрхивомАдресFTP,
			|	Константа.ИнтеграцияС1САрхивомПортFTP КАК ИнтеграцияС1САрхивомПортFTP,
			|	Константа.ИнтеграцияС1САрхивомПользовательFTP КАК ИнтеграцияС1САрхивомПользовательFTP,
			|	Константа.ИнтеграцияС1САрхивомПассивныйРежимFTP КАК ИнтеграцияС1САрхивомПассивныйРежимFTP");
		
		НастройкиСоеденения = Запрос.Выполнить().Выбрать();
		НастройкиСоеденения.Следующий();
		
		Если Не ЗначениеЗаполнено(НастройкиСоеденения.АдресFTP) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			ПараметрыПодключения = НовыеПараметрыПодключенияFTP();
			ПараметрыПодключения.КаталогFTP = НастройкиСоеденения.АдресFTP;
			ПараметрыПодключения.Логин = НастройкиСоеденения.ПользовательFTP;
			ПараметрыПодключения.Порт = НастройкиСоеденения.ПортFTP;
			ПараметрыПодключения.ПассивноеСоединение = НастройкиСоеденения.ПассивныйРежимFTP;
			ВладелецПароляFTPСервера = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
				Метаданные.Константы.ИнтеграцияС1САрхивомПользовательFTP);
			ПараметрыПодключения.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
				ВладелецПароляFTPСервера);
			
			FTPСоединение = НовоеFTPСоединение(ПараметрыПодключения);
			СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПараметрыПодключения.КаталогFTP);
			
			РазделительПути = "/";
			КаталогОбмена = СтруктураURI.ПутьНаСервере;
			КаталогОбмена = КаталогОбмена + ?(СтрЗаканчиваетсяНа(КаталогОбмена, РазделительПути), "", РазделительПути);
			
			РазделительПути = "/";
			ПодпапкаФайловВАрхив = КаталогОбмена + КодДляОбменаСАрхивом + "_to_Archive" + РазделительПути;
			ПодпапкаФайловИзАрхива = КаталогОбмена + "Archive_to_" + КодДляОбменаСАрхивом + РазделительПути;
			
			МассивФайлов = FTPСоединение.НайтиФайлы(ПодпапкаФайловВАрхив);
			Если МассивФайлов.Количество() = 0 Тогда
				FTPСоединение.СоздатьКаталог(ПодпапкаФайловВАрхив);
			КонецЕсли;
			МассивФайлов = FTPСоединение.НайтиФайлы(ПодпапкаФайловИзАрхива);
			Если МассивФайлов.Количество() = 0 Тогда
				FTPСоединение.СоздатьКаталог(ПодпапкаФайловИзАрхива);
			КонецЕсли;
			
			ПараметрыТранспорта.Вставить("FTPСоединение", FTPСоединение);
			ПараметрыТранспорта.Вставить("ПодпапкаФайловВАрхив", ПодпапкаФайловВАрхив);
			ПараметрыТранспорта.Вставить("ПодпапкаФайловИзАрхива", ПодпапкаФайловИзАрхива);
			
		Исключение
			ОбменСАрхивом.ЛогированиеОперацийОбменаСАрхивом(
				ОбменСАрхивом.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Неопределено;
		КонецПопытки;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ПараметрыТранспорта;
	
КонецФункции

// Краткое словеное описание назначения и/или принципов работы функции.
//
// Параметры:
//  ПараметрыТранспорта - Структура - см. ПараметрыТранспортаДляСеансаОбмена().
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица файлов:
//   * Файл - Файл - полное имя файла на диске. Файл на диске.
//      При обмене через общий каталог - файл в сетевом каталоге.
//      При обмене через FTP - файл во временной папке.
//   * ИмяНаСервере - Строка - имя файла на сервере.
//   * ПолноеИмяНаСервере - Строка - полное имя файла на сервере.
//
Функция ФайлыДляЗагрузки(ПараметрыТранспорта) Экспорт
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("Файл");
	ТаблицаФайлов.Колонки.Добавить("ИмяНаСервере");
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмяНаСервере");
	
	Если ПараметрыТранспорта.ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог Тогда
		
		НайденныеФайлы = НайтиФайлы(ПараметрыТранспорта.ПодпапкаФайловИзАрхива, ПолучитьМаскуВсеФайлы());
		Для Каждого ВходящийФайл Из НайденныеФайлы Цикл
			Если ВходящийФайл.ЭтоКаталог() Тогда
				Продолжить;
			КонецЕсли;
			Стр = ТаблицаФайлов.Добавить();
			Стр.Файл = ВходящийФайл;
			Стр.ИмяНаСервере = ВходящийФайл.Имя;
			Стр.ПолноеИмяНаСервере = ВходящийФайл.ПолноеИмя;
		КонецЦикла;
		ТаблицаФайлов.Сортировать("ИмяНаСервере");
		
	ИначеЕсли ПараметрыТранспорта.ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер Тогда
		
		НайденныеФайлы = ПараметрыТранспорта.FTPСоединение.НайтиФайлы(
			ПараметрыТранспорта.ПодпапкаФайловИзАрхива, ПолучитьМаскуВсеФайлы());
		Для Каждого ВходящийФайл Из НайденныеФайлы Цикл
			Если ВходящийФайл.ЭтоКаталог() Тогда
				Продолжить;
			КонецЕсли;
			Стр = ТаблицаФайлов.Добавить();
			Стр.Файл = ВходящийФайл;
			Стр.ИмяНаСервере = ВходящийФайл.Имя;
			Стр.ПолноеИмяНаСервере = ВходящийФайл.ПолноеИмя;
		КонецЦикла;
		ТаблицаФайлов.Сортировать("ИмяНаСервере");
		
		ЛимитКоличестваФайлов = 100;
		КоличествоФайлов = ТаблицаФайлов.Количество();
		Для Сч = 1 По КоличествоФайлов - ЛимитКоличестваФайлов Цикл
			ТаблицаФайлов.Удалить(ТаблицаФайлов[ЛимитКоличестваФайлов]);
		КонецЦикла;
		
		РазделительПути = ПолучитьРазделительПути();
		ВременнаяПапка = ПолучитьИмяВременногоФайла("");
		ВременнаяПапка = ВременнаяПапка	+ ?(Прав(ВременнаяПапка, 1) = РазделительПути, "", РазделительПути);
		СоздатьКаталог(ВременнаяПапка);
		Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
			ИмяСкачанногоФайла = ВременнаяПапка + СтрокаФайла.ИмяНаСервере;
			ПараметрыТранспорта.FTPСоединение.Получить(СтрокаФайла.ПолноеИмяНаСервере, ИмяСкачанногоФайла);
			СтрокаФайла.Файл = Новый Файл(ИмяСкачанногоФайла);
		КонецЦикла;
		
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Неизвестный вид транспорта для обмена: ""%1""'"),
			ПараметрыТранспорта.ВидТранспорта);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат ТаблицаФайлов;
	
КонецФункции

// Перемещает файл в каталог обработанных файлов, либо в каталог файлов с ошибками.
//
// Параметры:
//  СтрокаФайла - СтрокаТаблицыЗначений - см. ФайлыДляЗагрузки().
//  ЕстьОшибки - Булево - Истина, если при загрузке файла возникла ошибка и файл не загружен.
//  ПараметрыТранспорта - Структура - см. ПараметрыТранспортаДляСеансаОбмена().
//
Процедура ПереместитьЗагруженныйФайл(СтрокаФайла, ЕстьОшибки, ПараметрыТранспорта) Экспорт
	
	Если ПараметрыТранспорта.ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог Тогда
		
		РазделительПути = ПолучитьРазделительПути();
		ПодпапкаФайловИзАрхива = ПараметрыТранспорта.ПодпапкаФайловИзАрхива;
		ПодпапкаОбработанныхУспешно = ПодпапкаФайловИзАрхива + "Executed" + РазделительПути;
		ПодпапкаОбработанныхСОшибкой = ПодпапкаФайловИзАрхива + "Errors" + РазделительПути;
		СоздатьКаталог(ПодпапкаОбработанныхУспешно);	
		Если ЕстьОшибки Тогда
			СоздатьКаталог(ПодпапкаОбработанныхСОшибкой);
		КонецЕсли;
		ПереместитьФайл(СтрокаФайла.ПолноеИмяНаСервере,
			?(ЕстьОшибки, ПодпапкаОбработанныхСОшибкой, ПодпапкаОбработанныхУспешно) + СтрокаФайла.ИмяНаСервере);
		
	ИначеЕсли ПараметрыТранспорта.ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер Тогда
		
		РазделительПути = "/";
		ПодпапкаФайловИзАрхива = ПараметрыТранспорта.ПодпапкаФайловИзАрхива;
		ПодпапкаОбработанныхУспешно = ПодпапкаФайловИзАрхива + "Executed" + РазделительПути;
		ПодпапкаОбработанныхСОшибкой = ПодпапкаФайловИзАрхива + "Errors" + РазделительПути;
		
		FTPСоединение = ПараметрыТранспорта.FTPСоединение;
		МассивФайлов = FTPСоединение.НайтиФайлы(ПодпапкаОбработанныхУспешно);
		Если МассивФайлов.Количество() = 0 Тогда
			FTPСоединение.СоздатьКаталог(ПодпапкаОбработанныхУспешно);
		КонецЕсли;
		МассивФайлов = FTPСоединение.НайтиФайлы(ПодпапкаОбработанныхСОшибкой);
		Если ЕстьОшибки И МассивФайлов.Количество() = 0 Тогда
			FTPСоединение.СоздатьКаталог(ПодпапкаОбработанныхСОшибкой);
		КонецЕсли;
		
		ПолноеИмяНовое = ?(ЕстьОшибки, ПодпапкаОбработанныхСОшибкой, ПодпапкаОбработанныхУспешно)
			+ СтрокаФайла.ИмяНаСервере;
		МассивФайлов = FTPСоединение.НайтиФайлы(ПолноеИмяНовое);
		Если МассивФайлов.Количество() > 0 Тогда
			FTPСоединение.Удалить(ПолноеИмяНовое);
		КонецЕсли;
		
		FTPСоединение.Переместить(СтрокаФайла.ПолноеИмяНаСервере, ПолноеИмяНовое);
		УдалитьФайлы(СтрокаФайла.Файл.ПолноеИмя); // Удаляется файл из временной папки.
		
	Иначе
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Неизвестный вид транспорта для обмена: ""%1""'"),
			ПараметрыТранспорта.ВидТранспорта);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

// Отправляет указанный временный файл в 1С:Архив и удаляет его.
//
// Параметры:
//  ПолноеИмяФайла - Строка - полное имя файла (во временной папке), который необходимо отправить.
//  ПараметрыТранспорта - Структура - см. ПараметрыТранспортаДляСеансаОбмена().
//
Процедура ОтправитьФайл(ПолноеИмяФайла, ПараметрыТранспорта) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если ПараметрыТранспорта.ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог Тогда
		ПереместитьФайл(ПолноеИмяФайла, ПараметрыТранспорта.ПодпапкаФайловВАрхив + Файл.Имя);
	ИначеЕсли ПараметрыТранспорта.ВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер Тогда
		ПараметрыТранспорта.FTPСоединение.Записать(ПолноеИмяФайла, ПараметрыТранспорта.ПодпапкаФайловВАрхив + Файл.Имя);
		УдалитьФайлы(ПолноеИмяФайла);
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Неизвестный вид транспорта для обмена: ""%1""'"),
			ПараметрыТранспорта.ВидТранспорта);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает пустую структуру с параметрами подключения FTP.
//
// Возвращаемое значение:
//  Структура:
//   * КаталогFTP - Строка - полный путь к каталогу FTP.
//   * Логин - Строка - логин для подключения.
//   * Пароль - Строка - пароль для подключения.
//   * Порт - Число - номер порта. По умолчанию 21.
//   * ПассивноеСоединение - Булево - признак пассивного режима соединения. По умолчанию Истина.
//
Функция НовыеПараметрыПодключенияFTP() Экспорт
	
	ПараметрыFTP = Новый Структура;
	ПараметрыFTP.Вставить("КаталогFTP", "");
	ПараметрыFTP.Вставить("Логин", "");
	ПараметрыFTP.Вставить("Пароль", "");
	ПараметрыFTP.Вставить("Порт", 0);
	ПараметрыFTP.Вставить("ПассивноеСоединение", Истина);
	
	Возврат ПараметрыFTP;
	
КонецФункции

// Проверяет обмен через FTP для учетной записи прямого обмена.
// 
// Параметры:
// 	ПараметрыПодключенияFTP - Структура - см. НовыеПараметрыПодключенияFTP().
// 
// Возвращаемое значение:
// 	Строка - описание ошибки, если проверка прошла неудачно.
// 
Функция ПроверитьОбменЧерезFTP(ПараметрыПодключенияFTP) Экспорт
	
	ОписаниеОшибки = Неопределено;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла);
	ЗаписьТекста.ЗаписатьСтроку(ИмяВременногоФайла);
	ЗаписьТекста.Закрыть();
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПараметрыПодключенияFTP.КаталогFTP);
	ИмяФайлаНаСторонеПриемника = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяВременногоФайла).Имя;
	
	Попытка
		FTPСоединение = НовоеFTPСоединение(ПараметрыПодключенияFTP, 7);
		FTPСоединение.УстановитьТекущийКаталог(СтруктураURI.ПутьНаСервере);
		FTPСоединение.Записать(ИмяВременногоФайла, ИмяФайлаНаСторонеПриемника);
		FTPСоединение.Удалить(ИмяФайлаНаСторонеПриемника);
	Исключение
		ОписаниеОшибки = НСтр("ru = 'При проверке подключения возникли ошибки:'")
			+ Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ФайловаяСистема.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	Возврат ОписаниеОшибки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КаталогОбмена()
	
	УстановитьПривилегированныйРежим(Истина);
	
	КаталогОбмена = Константы.ИнтеграцияС1САрхивомКаталог.Получить();
	
	Если Не ЗначениеЗаполнено(КаталогОбмена) Тогда
		ОбменСАрхивом.ЛогированиеОперацийОбменаСАрхивом(
			ОбменСАрхивом.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НСтр("ru = 'Не указан каталог в константе ""Каталог интеграции с 1С:Архивом"".'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ФайлКаталога = Новый Файл(КаталогОбмена);
	Если Не ФайлКаталога.Существует() Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Неверный путь к каталогу обмена: ""%1""'"), КаталогОбмена);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	КаталогОбмена = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогОбмена);
	
	Возврат КаталогОбмена;
	
КонецФункции

Функция НовоеFTPСоединение(ПараметрыПодключенияFTP, Таймаут = 30)
	
	НастройкиFTP = Новый Структура("Сервер, Порт, Логин, Пароль, Прокси,
		|ПассивноеСоединение, Таймаут, ЗащищенноеСоединение");
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПараметрыПодключенияFTP.КаталогFTP);
	НастройкиFTP.Сервер = СтруктураURI.ИмяСервера;
	Если ЗначениеЗаполнено(ПараметрыПодключенияFTP.Порт) Тогда
		НастройкиFTP.Порт = ПараметрыПодключенияFTP.Порт;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыПодключенияFTP.Логин) Тогда
		НастройкиFTP.Логин = ПараметрыПодключенияFTP.Логин;
	Иначе
		НастройкиFTP.Логин = СтруктураURI.Логин;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыПодключенияFTP.Пароль) Тогда
		НастройкиFTP.Пароль = ПараметрыПодключенияFTP.Пароль;
	Иначе
		НастройкиFTP.Пароль = СтруктураURI.Пароль;
	КонецЕсли;
	НастройкиFTP.Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
	НастройкиFTP.ПассивноеСоединение = ПараметрыПодключенияFTP.ПассивноеСоединение;
	НастройкиFTP.Таймаут = Таймаут;
	НастройкиFTP.ЗащищенноеСоединение = ?(СтруктураURI.Схема = "ftps",
		ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(), Неопределено);
	
	Возврат Новый FTPСоединение(
		НастройкиFTP.Сервер,
		НастройкиFTP.Порт,
		НастройкиFTP.Логин,
		НастройкиFTP.Пароль,
		НастройкиFTP.Прокси,
		НастройкиFTP.ПассивноеСоединение,
		НастройкиFTP.Таймаут,
		НастройкиFTP.ЗащищенноеСоединение);
	
КонецФункции

#КонецОбласти
