
#Область ПрограммныйИнтерфейс

#Область РаботаСФормами

// Вызывается при создании формы интегрируемого объекта, после ОбменСАрхивом.ПриСозданииНаСервере.
// Позволяет переопределить поведение процедуры.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма объекта или списка.
//   ПараметрыРазмещения - Структура, Неопределено - см. ОбменСАрхивом.ПараметрыРазмещенияЭлементов.
//   ЭтоФормаОбъекта - Булево - Истина для формы объекта, Ложь для формы списка.
//
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта) Экспорт

	ЗарплатаКадры.ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта);
	
КонецПроцедуры

// Определяет, является ли переданная форма формой объекта.
// Предназначена для случаев, когда стандартный алгоритм из ОбменСАрхивом.ЭтоФормаОбъекта не подходит.
//  Например, если форма не содержит параметра "Основание".
//  Если функция возвращает значение типа Булево, стандартный способ вычисления не выполняется.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного объекта или списка.
//
// Возвращаемое значение:
//  Неопределено, Булево - Истина, если это форма объекта, Ложь, если форма списка.
//    Если Неопределено, будет использоваться типовой алгоритм вычисления. 
//
Функция ЭтоФормаОбъекта(Форма) Экспорт
	
	Возврат ЗарплатаКадры.ЭтоФормаОбъекта(Форма);
	
КонецФункции

// Возвращает имя реквизита формы, который содержит интегрируемый объект.
// 	Вызывается только для формы объекта (не списка).
//  Необходимо прописать здесь имена, которые отличаются от стандартного "Объект".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного объекта.
//
// Возвращаемое значение:
//  Неопределено, Строка - имя реквизита формы. Если не заполнено, будет использоваться имя "Объект".
//
Функция ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма) Экспорт
	
	Возврат ЗарплатаКадры.ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма);
	
КонецФункции

// Определяет имена команд, которые не следует добавлять на форму
//  в стандартном обработчике ПриСозданииНаСервере ни при каких условиях.
//  Например, если команда добавляется другим, нестандартным способом.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного объекта или списка.
//  ИменаИсключаемыхКоманд - Массив из Строка - массив имен команд.
//
Процедура ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд) Экспорт
	
	ЗарплатаКадры.ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд);
	
КонецПроцедуры

// Вызывается перед выполнением стандартной процедуры ОбменСАрхивом.УстановитьВидимостьИДоступностьКоманд.
//  Предназначена для случаев, когда нужно дополнить стандартный алгоритм, либо заменить его на свой.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного элемента.
//  СтандартнаяОбработка - Булево - если установить Ложь, стандартный обработчик выполняться не будет.
//
Процедура УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадры.УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

// Вызывается перед выполнением команды "Отправить в 1С:Архив".
// Здесь можно разместить прикладные проверки и отказаться от отправки.	
//  Например, если по документу есть задолженность.
//
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка - объект, отправляемый в 1С:Архив.
//  Отказ - Булево - если установить Истина, отправка в 1С:Архив будет прервана.
//
Процедура ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ) Экспорт

	ЗарплатаКадры.ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ);
	
КонецПроцедуры

// Вызывается при проверке заполнения документа БИА.
// Здесь можно добавить прикладные проверки и отказаться от записи.
//  Например, если в коллекции ПрочиеСвойства нет свойства, обязательного для данного вида документов.
//
// Параметры:
//  ДокументБИА - СправочникОбъект.ДокументыБИА - документ БИА.
//  Отказ - Булево.
//  ПроверяемыеРеквизиты - Массив из Строка - массив путей к реквизитам.
//
Процедура ОбработкаПроверкиЗаполненияДокументаБИА(ДокументБИА, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
	
КонецПроцедуры

// Ищет документы, отмеченные к отправке в 1С:Архив и формирует их в пакеты для отправки.
//
// Параметры:
//  СтандартнаяОбработка - Булево - если установить Ложь,
//   стандартный алгоритм формирования пакетов выполняться не будет.
//
Процедура СформироватьПакетыДокументов(СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается после того как из 1С:Архива получена информация о том,
//  что все документы, созданные на основании указанных объектов, приняты.
//
// Параметры:
//  Документы - Массив из ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА -
//   ссылки на интегрируемые объекты, переданные в 1С:Архив.
//  СтандартнаяОбработка - Булево - если установить Ложь, стандартный алгоритм удаления выполняться не будет.
//
Процедура УдалитьДанныеДокументовПринятыхВАрхив(Документы, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается после того как из 1С:Архива получена информация о том,
//  что все документы, созданные на основании указанных объектов, уничтожены.
//
// Параметры:
//  Документы - Массив из ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА -
//   ссылки на интегрируемые объекты, переданные в 1С:Архив и уничтоженные там после окончания срока хранения.
//
Процедура УдалитьДанныеДокументовУничтоженныхВАрхиве(Документы) Экспорт
	
	
	
КонецПроцедуры

// Заполняет таблицу реквизитов объектов НСИ для отправки в Архив.
//  Необходимо передать таблицу с именами колонок, соответствующими именам реквизитов объекта XDTO.
//
// Параметры:
//  СсылкиНаОбъектыНСИ - Массив из СправочникСсылка - порция измененных элементов НСИ одного типа.
//  ТипОбъектаXDTO - ТипОбъектаXDTO - тип объектов XDTO, которые будут созданы на основании переданных элементов.
//
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений -
//   * Ссылка - СправочникСсылка - ссылка на объект НСИ.
//   * <ИмяРеквизитаXDTO> - Произвольный - значение, соответствующее реквизиту объекта XDTO.
//  
//  Неопределено, если для указанного типа не предусмотрен алгоритм формирования данных.
//  В этом случае при обмене будет зафиксирована ошибка в журнале регистрации. 
//
Функция ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, ТипОбъектаXDTO) Экспорт
	
	Возврат ЗарплатаКадры.ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, ТипОбъектаXDTO);
	
КонецФункции

// См. описание функции ОбменСАрхивом.ДанныеМЧДДляВыгрузки.
// 
Функция ДанныеМЧДДляВыгрузки(МЧДСсылка, ВременнаяПапка) Экспорт
	
	
	
КонецФункции

// Выполняет обновление элементов справочника ВидыДокументовБИА,
//   обусловленное изменением конфигурации.
// 
// Параметры:
//  ПараметрОбработчика - Структура - параметры обязательного обработчика обновления.
//    Если в ходе выполнения обработчика возникает необходимость внесения изменений в ИБ,
//    обработчик должен установить значение свойства ПараметрОбработчика.МонопольныйРежим в Истина
//    и прекратить свое выполнение. После этого обработчик будет вызван повторно
//    после установки монопольного режима, значение ПараметрОбработчика.МонопольныйРежим будет равно Истина.
//    В этом втором вызове следует выполнять необходимые изменения данных. 
//
Процедура ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика) Экспорт
	
	ЗарплатаКадры.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);

КонецПроцедуры

// Обработчик подписки ОбновлениеВидовДокументовБИАПередЗаписью.
//  Совместно с ОбновлениеВидовДокументовБИАПриЗаписи предназначен
//   для создания видов документов БИА при записи прикладных объектов, включенных в подписку.
//
// Параметры:
//  Источник - СправочникОбъект - источник подписки ОбновлениеВидовДокументовБИАПередЗаписью
//  Отказ - Булево - отказ
// 
Процедура ОбновлениеВидовДокументовБИАПередЗаписью(Источник, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Обработчик подписки ОбновлениеВидовДокументовБИАПриЗаписи.
//  Предназначен для создания видов документов БИА при записи прикладных объектов, включенных в подписку.
//  Например, можно при записи элемента справочника "Виды договоров" создавать соответствующий ему вид документа БИА.
//
// Параметры:
//  Источник - СправочникОбъект - источник подписки ОбновлениеВидовДокументовБИАПриЗаписи
//  Отказ - Булево - отказ
// 
Процедура ОбновлениеВидовДокументовБИАПриЗаписи(Источник, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// Предназначена для случаев, когда процедура создания документов БИА
//  расположена нестандартно (т.е. не в модуле менеджера прикладного объекта).
//  Если функция возвращает значение, отличное от Неопределено,
//  стандартный вызов в модуль менеджера не выполняется.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из СправочникОбъект.ДокументыБИА, Неопределено - созданные документы.
//   Если возвращается Неопределено, то выполняется стандартное обращение к модулю менеджера объекта.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	Возврат ЗарплатаКадры.СоздатьДокументыБИА(СсылкаНаОбъектИсточник);
	
КонецФункции

// Возвращает строку, которая будет передана в 1С:Архив в качестве идентификатора ссылки.
//  Предназначена для случаев, когда нужно в качестве идентфиикатора передать не УникальныйИдентификатор ссылки,
//  а что-то другое. Например, ИНН/КПП для справочника Организаций.
//
// Параметры:
//  Ссылка - СправочникСсылка - ссылка на элемент (НСИ, ДокументБИА).
//
// Возвращаемое значение:
//  Строка, Неопределено - значение идентификатора. Если не заполнено,
//    значение будет вычислено по стандартному алгоритму.
//
Функция ИдентификаторСсылки(Ссылка) Экспорт
	
	
	
КонецФункции

// Вызывается при записи константы ИнтеграцияС1САрхивом.
// Здесь можно разместить код по изменению связанных с интеграцией настроек и служебных данных.
//
// Параметры:
//  Объект - КонстантаМенеджерЗначения.ИнтеграцияС1САрхивом - менеджер значения константы.
//  Отказ - Булево - если установить Истина, запись константы будет отменена. 
// 
Процедура ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ) Экспорт
	
	ЗарплатаКадры.ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ);
	
КонецПроцедуры

#КонецОбласти
