#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Возвращает узел для регистрации изменений для отправки в 1С:Архив.
// 
// Возвращаемое значение:
//  Неопределено, ПланОбменаСсылка.ОбменНСИСАрхивом - узел плана обмена.
// 
Функция УзелАрхив() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелАрхив = Неопределено;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОбменНСИСАрхивом.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменНСИСАрхивом КАК ОбменНСИСАрхивом
		|ГДЕ
		|	НЕ ОбменНСИСАрхивом.ЭтотУзел");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		УзелАрхив = Выборка.Ссылка;
	Иначе
		НачатьТранзакцию();
		Попытка
			Блокировки = Новый БлокировкаДанных;
			Блокировки.Добавить("ПланОбмена.ОбменНСИСАрхивом");
			Блокировки.Заблокировать();
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				УзелАрхив = Выборка.Ссылка;
			Иначе
				УзелАрхивОбъет = СоздатьУзел();
				УзелАрхивОбъет.Код = "Архив";
				УзелАрхивОбъет.Наименование = НСтр("ru = 'Архив'");
				УзелАрхивОбъет.Записать();
				УзелАрхив = УзелАрхивОбъет.Ссылка;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Возврат УзелАрхив;
	
КонецФункции

#КонецОбласти

#КонецЕсли
